-- 模组增加开发版本

-- 蚁狮蝎子
-- 伏特羊闪电特效


-- 批量调味
-- 批量搓粉
-- 灵感，恢复沃尔特的连发子弹，但是连发子弹后续子弹都只能造成小部分伤害


-- 棋子影怪消失机制回归
-- 普通影怪的机制给到棋子影怪
-- 棋子影怪和发条联动
-- 火影棋子,电影棋子,霜影棋子,带属性和特效的棋子
-- 灵感,鱼人沃特给普通鱼人四种季节海鱼可以使其进化为精英鱼人
-- 韦伯谋杀蜘蛛导致所有随从蜘蛛叛变,周围的蜘蛛仇恨
-- 沃特同上
-- 灵感,染色球,可以标记单位在地图上一定天

-- 灵感,发条堆和破损发条不再自我修复,但是附近的影怪消失时可以为其恢复,最后修复成发条
-- 灵感,棋子影怪消失时剩余血量也可以为其恢复修复
-- 灵感,发条死亡时生成一个远古影怪
-- 灵感,发条和影怪现在是队友了
-- 灵感,战士棋子影怪具有火影冲锋能力,伤害可以在敌人身上引燃影火,无视凡火防御
-- 灵感,主教棋子影怪具有电影波纹能力,能持续电击敌人,玩家绝缘无法规避
-- 战士棋子的火影改为大喷火(喷月火的暗影版本)
-- 灵感,战车棋子影怪具有霜影能力,能制造影冰墙,影冰墙无碰撞但能持续施加冰冻和易伤
-- 灵感,月光具有石化和净化力量

-- 灵感,天体一阶段具有重力/引力能力,能释放万象天引,持续拉扯周围的单位
-- 天体二阶段可以灵活切换二者
-- 天体三阶段具有斥力,可以斥退敌人,从而让不再方便对付三阶段

-- 灵感,帝王蟹具有净化和石化能力

-- 灵感,CTRL ALT右键道具可以从箱子里收集该道具甚至同类的道具,比如玩具收集玩具,杂物收集杂物
-- 灵感,亮茄可以伪装成疲惫状态,当然也可以疲惫状态伪装成强壮状态...

-- 灵感,同一角色所有玩家都只给一次初始物品
-- 灵感,可选全角色无初始物品
-- modmain.lua modimport modinfo.lua
-- 灵感,辉煌和暗影铸台加强

-- 灵感,与日渐弱,玩家的所有状态都会慢慢变弱
-- 灵感,与日渐弱,玩家会每过一段时间丢失一种动作
-- 不能骑乘,不能下来,不能装备,不能卸下装备,不能丢东西,不能捡东西,不能吃东西
-- 所有动作都有可能
-- 死亡会恢复最近损失的一种动作

-- 灵感,可以一边移动一边近战攻击的武器,,,

-- 灵感,水土流失
-- 农作物每次长大时都会伤害所在地皮,在该地皮上制造一个杂物或一个裂缝(dock_damage改造),杂物可以铲掉,
-- 但裂缝需要用特定道具修补,否则耕地地皮上浇的水和肥料都会几何倍率丢失