---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    额外的装备槽

]]--
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- 装备槽内容
    -- EQUIPSLOTS["TBAT_MAP_JUMPER"] = "tbat_map_jumper" -- 地图跳跃用。
    EQUIPSLOTS["TBAT_PET_EYEBONE_BACKPACK"] = "tbat_pet_eyebone_backpack" -- 宠物骨眼背包
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--- 装备槽检查器，用来处理某些五格MOD的覆盖型问题
    local function equipsolot_checker()
        if EQUIPSLOTS.TBAT_MAP_JUMPER == nil then
            local test = {}
            local str = "万物书：检测到不兼容装备槽扩展MOD 。 The Book of All Things: Incompatible equipment slot expansion MOD detected."
            TheNet:Announce(str)
            Networking_SystemMessage(str)
            local temp = test[str] + 1
        else
            print("info [万物书]: 额外装备槽检测正常。")
        end
    end
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
-- AddPrefabPostInit("world",function(inst)
--     equipsolot_checker()
-- end)