--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[


    为了让锅 能预览配方成品。配方注册遵循下面原则：
    · 配方注册同时在客户端和服务端
    · 配方注册有增序索引id
    · 顺着索引id序号，找到第一个合适的配方立马退出寻找。
    · 【注意】配方物品种类同样，数量不一样的情况交由策划处理。代码上永远只找第一个符合的出来。
    · 每次只制作一组。多余的材料返还。
    · 所有配方都是指定物品指定数量
    · 必须满4个格子才能开始制作。
    · 如果4个格子里，有同种类的物品，则以总数计算。
            【例子】： 
                    【配方】： 【1木头】【1木头】【1木头】【1木头】  -> 计【4木头】 -> 寻找配方里是4个木头的。


]]--
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


modimport("scripts/_key_modules_of_tbat/16_mushroom_snal_cauldron_sys/01_base_api.lua")
--- 基础API

modimport("scripts/_key_modules_of_tbat/16_mushroom_snal_cauldron_sys/02_recipe_register.lua")
--- 配方注册
modimport("scripts/_key_modules_of_tbat/16_mushroom_snal_cauldron_sys/03_whisper_of_snail.lua")
--- 封装悄悄话API




-- modimport("scripts/_key_modules_of_tbat/16_mushroom_snal_cauldron_sys/100_debug_unlocker.lua")
-- --- 调试用的配方