-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    重要的物品列表名单。

    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！
    【注意】修改后记得备份到别处，这个地方会被git更新替换覆盖！！！！！！

]]--
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
return {
    -- ["test_1"] = true,-- 测试物品1
    -- ["test_2"] = true,-- 测试物品2
    -- ["log"] = true,-- 木头。
    ["deerclops_eyeball"] = true,-- 巨鹿眼球
}