-- 百科全书数据表，使用嵌套表结构存储百科内容

_G.ENCYCLOPEDIA_DATA2HM = {
    title = "模组百科",
    -- 定义章节显示顺序
    section_order = { "内置功能", "困难模式", "生存削弱", "世界机制改动", "互动事件改动", 
                      "中立生物改动", "敌对生物改动", "怪物头目改动",
                      "简单模式", "角色改动", "建筑改动", "道具改动", "装备改动"},
    sections = {
        ["内置功能"] = {
            title = "内置功能",
            -- 定义子章节显示顺序
            subsection_order = {
                "容器整理收集按钮", "道具快捷收集存放", "制作栏提示", "角色标签限额"
            },
            subsections = {
                ["容器整理收集按钮"] = {
                    title = "容器整理收集按钮",
                    subsubsections = {
                        ["整理"] = {
                            title = "整理",
                            content = {
                                "排序该容器内道具",
                                "背包双击会混合排序物品栏和背包内道具",
                            }
                        },
                        ["收集"] = {
                            title = "收集",
                            content = {
                                "容器收集附近容器内同名道具",
                                "不会跨船,佩戴或手持懒人护符点按钮,则拾取周围地上容器内同名道具",
                            }
                        },
                        ["跨整"] = {
                            title = "跨整",
                            content = {
                                "背包会混合排序物品栏和背包内道具",
                                "携带容器混合排序所在容器内的所有同类容器内道具",
                                "地面容器会混合排序周围同名容器内道具,不会跨船",
                            }
                        },
                        ["穿越"] = {
                            title = "穿越",
                            content = {
                                "仅各种末影箱,与其他世界的该容器交换道具",
                                "世界不同步时可能穿越失败，暂停游戏后再试试",
                                "未确定穿越已经成功时不要反复点击穿越或者存放拿取物品，后果严重",
                            }
                        },
                        ["换装"] = {
                            title = "换装",
                            content = {
                                "兼容妥协衣柜，打开衣柜时可以点击按钮换装",
                            }
                        },
                        ["锁定/解锁"] = {
                            title = "锁定/解锁",
                            content = {
                                "限制该容器内存放的物品类型",
                                "重新加载时可能文本显示有误，不影响使用",
                            }
                        }
                    }
                },
                ["道具快捷收集存放"] = {
                    title = "道具快捷收集存放",
                    content = {
                        "制作栏右键道具,或左键右键材料,从附近容器收集需要的道具或材料",
                        "物品栏按住CTRL右键道具,将该道具存放到附近非分解类的容器,不能存放溯源表裂缝表"
                    }
                },
                ["制作栏提示"] = {
                    title = "制作栏提示",
                    content = {
                        "制作栏的道具若有本模组改动可以显示改动提示"
                    }
                },
                ["角色标签限额"] = {
                    title = "角色标签限额",
                    content = {
                        "默认关闭，原版玩家具有64个标签上限（如可以读书的标签），标签容易溢出导致bug",
                        "若溢出导致bug可以开启该改动使角色没有标签上限限制"
                    }
                }
            }
        },
        ["困难模式"] = {
            title = "困难模式（主题1）",
            subsection_order = {"暗影世界系统", "随机大小系统", "巨兽装甲系统", "战斗强化系统"},
            subsections = {
                ["暗影世界系统"] = {
                    title = "暗影世界系统",
                    subsubsections = {
                        ["基本机制"] = {
                            title = "基本机制",
                            content = {
                                "为爽而虐主要模块，给部分单位增加了可选的1~3个影分身",
                                "协助其进行战斗，仅可以移动且有血量的单位会有影分身",
                                "海鱼也会有影分身",
                                "可选：上述单位/仅BOSS/仅非BOSS/仅宠物",
                                "触发条件：半血/残血/一定血量时才生出影分身"
                            }
                        },
                        ["影分身特性"] = {
                            title = "影分身特性",
                            content = {
                                "影分身是单位的复制体，击败无掉落",
                                "可选时间后复活",
                                "影分身AI可选保护单位或仇恨玩家",
                                "玩家远离单位一定距离后，影分身消失回归",
                                "boss和友好生物外的生物存在数量上限18个，达上限后无分身生物拥有67%减伤",
                                "BOSS单位的影分身默认不计算远离距离限制"
                            }
                        },
                        ["第二周目"] = {
                            title = "第二周目",
                            content = {
                                "默认关闭",
                                "开启第二周目且当地表击败天体英雄或洞穴击败远古织影者后：",
                                "  此世界的单位会在失去仇恨/脱离加载后把影分身传送到单位周围",
                                "  此世界的影分身也会在失去仇恨/脱离加载后自主传送到单位周围"
                            }
                        }
                    }
                },
                ["随机大小系统"] = {
                    title = "随机大小系统",
                    subsubsections = {
                        ["基本机制"] = {
                            title = "基本机制",
                            content = {
                                "内置并修改了@萌萌哒女王Yao~的模组",
                                "部分单位新生时，应用随机大小",
                                "生命值/体型/伤害/掉落物都会因此变化",
                                "体型在1~2变化时，移速和伤害在1~1.5倍变化",
                                "驯化好的牛体型最大为1.5倍，重新加载时生效（伤害变化即时生效）",
                                "体型变化会连锁导致移速变化"
                            }
                        },
                        ["概率分布"] = {
                            title = "概率分布",
                            content = {
                                "有生命单位：4.3%概率在1.35-2倍，95.6%的概率在0.75-1.2倍",
                                "无生命单位：10%概率1.35倍，90%概率在0.75-1.2倍",
                                "大于1.3倍双倍掉落",
                                "游戏中途玩家周围的新生单位不会随机大小"
                            }
                        }
                    }
                },
                ["巨兽装甲系统"] = {
                    title = "巨兽装甲系统",
                    subsubsections = {
                        ["基本机制"] = {
                            title = "基本机制",
                            content = {
                                "巨兽在脱离加载后将免疫攻击",
                                "每当被攻击掉落一定血量百分比会发动一次能力"
                            }
                        },
                        ["能力阶段"] = {
                            title = "能力阶段",
                            content = {
                                "进入数秒无敌，在此期间受到攻击会积累力量，并生成流星攻击打击者",
                                "结束后将依据积累的力量比例生成吸收盾，一次性生成大量流星攻击",
                                "吸收盾持续期间将比例回复受到伤害的生命值，同时继续生成随机流星",
                                "持续结束后回到基础状态"
                            }
                        },
                        ["装甲等级"] = {
                            title = "装甲等级",
                            content = {
                                "默认是1级装甲，无流星和回血",
                                "仅30秒内承受40%伤害时触发无敌护盾"
                            }
                        }
                    }
                },                        
                ["战斗强化系统"] = {
                    title = "战斗强化系统",
                    subsubsections = {
                        ["空袭机制"] = {
                            title = "空袭机制",
                            content = {
                                "飞行单位的近身攻击会袭击头部",
                                "需要头部防御，身甲无法抵御（恐怖盾牌可以）"
                            }
                        },
                        ["精英属性系统"] = {
                            title = "精英属性系统",
                            content = {
                                "非boss生物或者血量低于3500的boss有7.5%出现精英属性，若血量小于180则只有4.5%概率",
                                "独立概率，可以叠加出现",
                                "依据身体颜色分类：",
                                "  红色：攻击附带火焰",
                                "  蓝色：攻击附带冰冻",
                                "  绿色：攻击附带短时间中毒，死亡生成毒雾圈",
                                "  黄色：攻击附带电伤",
                                "  橙色：更高防御，攻击附带击飞效果",
                                "  彩虹无色：移速更快抗性更高，被攻击到会进入短暂隐身",
                                "依据是否为远程精英：",
                                "  生物身上会有紫色亮点",
                                "  攻击可以远程发射弹药",
                                "  包括：铥矿子弹、冰冻子弹、闪电子弹、大理石子弹、火焰子弹、击飞子弹等"
                            }
                        },
                        ["无阻可挡"] = {
                            title = "无阻可挡",
                            content = {
                                "生物被建筑卡位若产生仇恨时会撞坏建筑",
                                "无法破坏以及在海边会在卡位1s后进入无敌状态"
                            }
                        },
                        ["恐惧镇定"] = {
                            title = "恐惧镇定",
                            content = {
                                "生物被点燃、恐惧时，如果收到攻击会无视恐惧仇恨反击"
                            }
                        },
                        ["无端仇恨"] = {
                            title = "无端仇恨",
                            content = {
                                "受到无来源伤害时会寻找玩家目标并仇恨",
                                "当玩家的随从作为其他单位的仇恨目标消失时，仇恨会转移到玩家身上",
                                "当小丑机生成怪物时会直接仇恨玩家"
                            }
                        },
                        ["移动攻击"] = {
                            title = "移动攻击",
                            content = {
                                "包括蝙蝠、蠕虫与蛞蝓龟等"
                            }
                        },
                        ["再生之殇"] = {
                            title = "再生之殇",
                            content = {
                                "主要生物包括伏特羊，耗牛，猪人，兔人等再生速度默认8倍"
                            }
                        },
                        ["动物箱庭"] = {
                            title = "动物箱庭",
                            content = {
                                "容器中的生物会向食物移动，一分钟一格，最后吃掉临近食物",
                                "容器中大鱼会缓慢移动吃掉小鱼，一只大鱼一天平均吃掉一条小鱼"
                            }
                        }
                    }
                },
            }
        },
        ["生存削弱"] = {
            title = "生存削弱",
            subsection_order = {
                "血量险境", "理智险境", "饥饿险境", "温度险境", "湿度险境", 
                "友伤险境", "战斗险境", "电击险境", "盾牌无伤", "攻速调整", "领袖险境",
                "海棠语险境", "魂归荒野", "再生之殇系统", "诅咒装备详解", 
                "延迟下线"
            },
            subsections = {
                ["血量险境"] = {
                    title = "血量险境",                            
                    content = {
                        "承受伤害增加20%",
                        "治疗效果减少20%",
                        "吃鱼干回复回血量/2的血量上限",
                        "吃含有鱼度的料理时可以回复回血量/10的血量上限",
                        "永不妥协盐晶药膏配方所需海带叶数量1→3，强心针配方红蘑菇数量4→2",
                        "制作物品消耗血量时损失一半的血量上限"
                    }
                },
                ["理智险境"] = {
                    title = "理智险境",                            
                    content = {
                        "掉血时同时会掉理智",
                        "制作物品扣除等同于消耗的理智的理智上限",
                        "理智上限每30s回复10点",
                        "帐篷也能回复理智上限",
                        "同种理智增益光环只会生效一个",
                        "饱食度溢出时理智值会减少（启蒙状态则增加）"
                    }
                },
                ["饥饿险境"] = {
                    title = "饥饿险境",
                    content = { 
                        "长时间处于0饱食度会缓慢掉落饱食度上限",
                        "死亡损失15%饥饿上限，死于饥饿额外损失5%",
                        "饱食度上限回复方式：",
                        "  肉干、海带干、种子干：按回血量2:1回复",
                        "  普通食物或料理：按回血量9:1回复",
                        "  强心针：直接回复最大饱食度一半的饥饿上限"
                    }
                },
                ["温度险境"] = {
                    title = "温度险境",
                    content = { 
                        "保暖隔热效果削减240点",
                        "安全温度范围从0-70变为5-65"
                    }
                },
                ["湿度险境"] = {
                    title = "湿度险境",
                    content = { 
                        "潮湿度增加速率变为原来的2倍"
                    }
                },
                ["友伤险境"] = {
                    title = "友伤险境",
                    content = { 
                        "玩家无法直接攻击其他玩家",
                        "但可能被间接误伤（如阿比盖尔、弹弓溅射等）"
                    }
                },
                ["战斗险境"] = {
                    title = "战斗险境",
                    content = { 
                        "默认关闭",
                        "伤害加成从乘算改为取最大加成",
                        "其他加成减半但有上限"
                    }
                },
                ["电击险境"] = {
                    title = "电击险境",
                    content = { 
                        "电击僵直只有在生物潮湿状态才会触发",
                        "潮湿实体受到带电伤害倍率 2.5 → 2",
                        "干燥状态不变",
                        "晨星锤基础伤害 28.9 → 34"
                    }
                },
                ["盾牌无伤"] = {
                    title = "盾牌无伤",
                    content = { 
                        "兼容棱镜模组",
                        "盾牌不再反伤，改为伤害减免"
                    }
                },
                ["攻速调整"] = {
                    title = "攻速调整",
                    content = { 
                        "攻击间隔匹配动画",
                        "后摇可打断但无法提前攻击"
                    }
                },
                ["领袖险境"] = {
                    title = "领袖险境",
                    content = { 
                        "玩家最多拥有10个随从（可修改）"
                    }
                },
                ["海棠语险境"] = {
                    title = "海棠语险境",
                    content = { 
                        "身上存在诅咒的玩家会不由自主使用海棠语"
                    }
                },
                ["魂归荒野"] = {
                    title = "魂归荒野",
                    content = { 
                        "死亡灵魂拥有50血量，可作祟物品灭火",
                        "白天缓慢掉血并损失血量上限",
                        "灵魂血量归0会在大门重生",
                        "重生时血量上限恢复，但饥饿上限保留损失",
                        "遗忘所有制作配方和地图"
                    }
                },
                ["再生之殇系统"] = {
                    title = "再生之殇系统",
                    content = { 
                        "死亡复活后获得4分钟诅咒装备",
                        "回档前死亡，回档后依旧被诅咒"
                    }
                },
                ["诅咒装备详解"] = {
                    title = "诅咒装备详解",
                    content = { 
                        "自带发光，占用随机装备位置",
                        "加快饥饿消耗",
                        "头部/身体装备会自适应季节（480保暖或隔热）",
                        "可无限叠加，可短暂摘下但无法用鼠标操作",
                        "帐篷休息可4倍速消除诅咒",
                        "换角色依旧保留"
                    }
                },
                ["延迟下线"] = {
                    title = "延迟下线",
                    content = { 
                        "下线延迟15秒",
                        "请在安全区下线"
                    }
                }
            }
        },
        ["世界机制改动"] = {
            title = "世界改动",
            subsection_order = {
                "漫漫长夜", "启迪新月", "混乱季节", "潮湿空气", "全图沙暴", "冬季极光", 
                "风暴来袭", "复杂地形", "冒险之海", "洞穴限行", "档案馆解密系统", "绚丽之门", 
                "矿物削弱", "护目镜限制", "食物削弱", "种子机制", "作物系统", "植物再生", "蜘蛛巢穴机制"
            },
            subsections = {
                ["漫漫长夜"] = {
                    title = "漫漫长夜",
                    content = { 
                        "默认设置下，黄昏的大部分时间会变成夜晚"
                    }
                },
                ["启迪新月"] = {
                    title = "启迪新月",
                    content = { 
                        "仅靠近满月的几天有世界光照"
                    }
                },
                ["混乱季节"] = {
                    title = "混乱季节",
                    content = { 
                        "天体月亮风暴存在时立刻进入恶劣混乱季节",
                        "每个季节后的下个季节随机，较少秋季，且可能始终相同"
                    }
                },
                ["潮湿空气"] = {
                    title = "潮湿空气",
                    content = { 
                        "春夏秋冬的湿度变化分别为原来的8倍、0.5倍、1倍、8倍",
                        "洞穴湿度变为原来的4倍",
                        "空气潮湿度较高时会下水球雨，可以增加潮湿度并浇灭火焰"
                    }
                },
                ["全图沙暴"] = {
                    title = "全图沙暴",
                    content = { 
                        "会不定时的袭击（非夏季概率较低）",
                        "从空中掉落物品",
                    }
                },
                ["冬季极光"] = {
                    title = "冬季极光",
                    content = { 
                        "冬季偶尔会在玩家周围刷新冷星",
                        "效果与极光一致，跟随玩家",
                        "靠近热源一段时间后消失"
                    }
                },
                ["风暴来袭"] = {
                    title = "风暴来袭",
                    content = { 
                        "蚁狮会出现在春季和秋天",
                        "钓出沙滩玩具的概率减少",
                        "学会瓜皮头和未学会时开包裹开出沙滩玩具后分别有50%和87.5%的概率被替换为随机玩具",
                        "（学会护目镜但不会瓜皮头）实际开包裹开出玩具的概率约为3%~4%",
                        "秋天开始时将开始下雨"
                    }
                },
                ["复杂地形"] = {
                    title = "复杂地形",
                    content = { 
                        "默认关闭",
                        "地形会随机从0~4级岛屿复杂程度出现",
                        "分别是：基本无新岛屿、较少岛屿、有些岛屿、许多岛屿",
                        "地下地形也有可能出现岛屿分隔或者环形等情况",
                        "梦幻群岛，究极破碎，同时世界显著增大"
                    }
                },
                ["冒险之海"] = {
                    title = "冒险之海",
                    content = { 
                        "火坑燃料大于50%可能会烧穿船只",
                        "海盗猴相关改动见中立生物改动",
                        "夹夹绞盘需要8点好感度兑换蓝图",
                        "海盗地图在x宝藏开完后会生成额外的宝藏并标记在地图上",
                        "沉底宝藏会开出额外的临时装备（香炉小偷包启迪之冠鼹鼠帽各5%）",
                        "   -具有临时属性，香炉耐久10天，鼹鼠帽小偷包耐久20天，启迪之冠耐久50天"
                    }
                },
                ["洞穴限行"] = {
                    title = "洞穴限行",
                    content = { 
                        "地上洞穴入口会隐藏起来",
                        "黄昏夜间依旧有蝙蝠巡逻",
                        "凿洞口时会掉san并且出现蝙蝠警告",
                        "地上洞穴偶尔会堵住，可以用两个火药炸开（或者用大理石堵住）",
                        "地下出口只有两个可以通过，月黑转换出口",
                        "可以手持懒人手帐使用远古钥匙打开出口，会消耗手杖耐久",
                        "小恶魔手持灵魂可以通过"
                    }
                },
                ["档案馆解密系统"] = {
                    title = "档案馆解密系统",
                    content = { 
                        "使用三个彩虹宝石激活时如果非秋季会强制将季节变为秋季（秋季复苏）",
                        "消耗掉三个彩红宝石使世界变为月圆",
                        "解密难度增加",
                        "星象探测仪：原版解密",
                        "尘土块：顺序交换，每次错误会将起点前推或者后移一个格子",
                        "土地夯实器：起点交换，解密的相对位置不会改变，每次错误会重置起点",
                        "兼容能力勋章：每个空白勋章解密为以上三个随机一种"
                    }
                },
                ["绚丽之门"] = {
                    title = "绚丽之门",
                    content = { 
                        "未净化时在月黑时或玩家作祟复活后会变成黑门，灵魂无法借助复活",
                        "每位玩家的每位初始角色只可以获得一次初始装备",
                        "大门可以用彩红宝石净化，消耗宝石，刷新一只爬行梦魇，梦魇尖喙和爬行梦魇",
                        "净化过的绚丽之门才能使用传送门套件"
                    }
                },
                ["矿物削弱"] = {
                    title = "矿物削弱",
                    content = { 
                        "玩家开采矿物的效率减半"
                    }
                },
                ["护目镜限制"] = {
                    title = "护目镜限制",
                    content = { 
                        "限制风暴种类",
                        "如天体风暴里只能使用星象护目镜、亮茄头盔和启迪之冠"
                    }
                },                        
                ["食物削弱"] = {
                    title = "食物削弱",
                    content = {
                        "回复的属性减少，削减的属性增加",
                        "食物削弱不包含各类肉干及蘑菇",
                        "不新鲜时回复的饱食度削减比原版较少"
                    }
                },
                ["种子机制"] = {
                    title = "种子机制",
                    content = {
                        "种子只可以种植在耕地中",
                        "任何种子或者浆果在容器中腐烂后都会变成干种子，回复饱食度上限的小瓜子，浆果同理",
                        "普通种子长成杂草的概率显著提升",
                        "任何种子的三维属性大幅减少"
                    }
                },
                ["作物系统"] = {
                    title = "作物系统",
                    content = {
                        "作物生长时间默认2倍",
                        "田地削弱,农作物长好时0.1概率水土流失,刚耕的地也必定水土流失",
                        "石定时消耗养料,养料和水分不足则周围的农作物全部铲除视为干死,耕地铲除，速率等于一株杂草的消耗速率",
                        "采集后会概率刷出农田杂物",
                        "极光、冬季、冰眼结晶器可以消除裂隙"
                    }
                },
                ["植物再生"] = {
                    title = "植物再生",
                    content = {
                        "包括草、树枝、香蕉苗等再生速度默认8倍",
                        "大理石树生长速度为默认的3倍",
                        "大理石芽可以读书催熟(仅一个阶段)",
                        "巨石树的巨石掉落造成伤害时额外摧毁易碎物品并破坏建筑",
                        "妥协蓝莓，棱镜子圭种，富贵险中求的挤奶等"
                    }
                },
                ["蜘蛛巢穴机制"] = {
                    title = "蜘蛛巢穴机制",
                    content = {
                        "蜘蛛死亡时会使其巢穴倾巢出动",
                        "破碎蜘蛛巢自我修复时间2分钟→40分钟",
                        "若巢穴蜘蛛全部阵亡巢穴降级并召唤洞穴悬蛛作战"
                    }
                }
            }
        },
        ["互动事件改动"] = {
            title = "互动事件改动",
            subsection_order = {
                "远古雕像", "远古科技塔", "其他建筑", "树木相关", "植物采集", "打捞海底宝藏", 
            },
            subsections = {
                ["远古雕像"] = {
                    title = "远古雕像",
                    content = { 
                        "敲击概率出现事件，与原版锤击远古塔一致",
                        "最后一击需要多用斧镐，必定出现元素反应事件刷新影怪",
                        "元素反应效果：",
                        "  红宝石：火焰法阵",
                        "  蓝宝石：冰冻法阵",
                        "  绿宝石：腐败法阵",
                        "  紫宝石：束缚法阵",
                        "  橙宝石：地陷"
                    }
                },
                ["远古科技塔"] = {
                    title = "远古科技塔",
                    content = { 
                        "完整的远古塔需要锤击四下变残破",
                        "完整科技塔旁并且理智高于95%制作物品不会锤击",
                        "残塔无论如何制作都会导致塔被锤击",
                        "玩家每锤击一个阶段会刷新事件且刷新一个三基佬"
                    }
                },
                ["其他建筑"] = {
                    title = "其他建筑",
                    content = { 
                        "敲骨架可能出幽灵",
                        "砍浮木桩可能出背壳蜗牛"
                    }
                },
                ["树木相关"] = {
                    title = "树木相关",
                    content = { 
                        "黄昏黑夜砍松树常青树出现蝙蝠（吴迪变海狸人无视）",
                        "砍掉桦栗树会出现桦栗果精（吴迪变海狸人无视）"
                    }
                },
                ["植物采集"] = {
                    title = "植物采集",
                    content = { 
                        "采集或挖浆果丛概率直接出现火鸡，会主动攻击",
                        "采集或铲石果会吸引周围的沙拉蝾螈主动攻击",
                        "海带和芦苇采集和移植时，概率出现触手袭击",
                        "猴尾草和香蕉采集和移植时，概率出现海盗猴袭击"
                    }
                },
                ["打捞海底宝藏"] = {
                    title = "打捞海底宝藏",
                    content = { 
                        "打捞海底宝藏时，刷新海盗袭击（概率极低）"
                    }
                }
            }
        },
        ["中立生物改动"] = {
            title = "中立生物",
            subsection_order = {
                "鸟类","蝴蝶","高脚鸟","火药猴","海鱼","寄居蟹隐士","皮弗洛牛",
                "猪人","暗影猴","水獭","伏特羊","食人花","月亮孢子","脚印",
                "格罗姆","小切、哈奇","鬼魂","多枝树","草根","杂草"
            },
            subsections = {
                ["鸟类"] = {
                    title = "鸟类",
                    content = {
                        "血量变为100点",
                        "喂食有负面血量的食物时鸟会掉血，玩家也会被反伤",
                        "鸟的血量不够消耗时会拒绝食用负血量食物",
                        "诅咒效果：",
                        "  金丝雀：电击反伤",
                        "  红雀：反伤升温",
                        "  雪雀：反伤冰冻降温",
                        "  海鹦鹉：反伤潮湿冰冻降温",
                        "  乌鸦：反伤掉血并且降低血量上限",
                        "  啄木鸟（妥协生物）：获得持续掉血debuff",
                        "被陷阱捕捉不会回血，但吃回血食物回血效果翻4倍"
                    }
                },
                ["蝴蝶"] = {
                    title = "蝴蝶",
                    content = {
                        "死亡有12.5%概率使花朵枯萎"
                    }
                },
                ["高脚鸟"] = {
                    title = "高脚鸟",
                    content = {
                        "死亡有50%概率掉落高脚鸟蛋"
                    }
                },
                ["火药猴"] = {
                    title = "火药猴",
                    content = {
                        "香蕉无法交换蓝图而是减少一个诅咒饰品，海盗地图减少4个",
                        "当身上无诅咒饰品时，用海盗地图换取蓝图",
                        "打捞沉底宝箱时2.5%概率来海盗船",
                        "正常海盗袭击时概率多来1或2个海盗船",
                        "猴子死亡时概率信号弹或摧毁烧毁猴子小屋都概率出现海盗援军",
                        "海贼猴不再溺水，而是出现在最近的岸上",
                        "海盗船在猴岛附近时就不会消失",
                        "海盗帽子可以给制图桌擦除获得海盗旗子",
                        "海盗旗子可以给制图桌擦除获得莎草纸",
                        "木头短剑做燃料后15%给一个海盗地图",
                        "海盗头巾可以制图桌25%擦出海盗地图",
                    }
                },
                ["海鱼"] = {
                    title = "海鱼",
                    content = {
                        "死亡概率掉落宝石、瓶中信与诅咒饰品",
                        "持于手中概率挣扎落地",
                        "四种季节鱼置于手中分别在脚下生成毒圈、火法阵、毒圈、冰法阵",
                        "旁边如果有海洋，地上的海鱼会自己向海的方向移动游入水中",
                        "保持体温的能力削弱（受新鲜度影响）",
                        "捕鱼器的效率只有原来的25%，并且近距离的海钓不再拥有吸引力"
                    }
                },
                ["寄居蟹隐士"] = {
                    title = "寄居蟹隐士",
                    content = {
                        "兑换夹夹绞盘蓝图额外需要好感度8且需要3个空瓶子"
                    }
                },
                ["皮弗洛牛"] = {
                    title = "皮弗洛牛",
                    content = {
                        "初始具有有一定的驯化趋势",
                        "喂掉血时会仇恨玩家",
                        "平静无仔且驯化度大于30%状态才可以绑定牛铃",
                        "使用橙宝石升级铃铛使牛可以被随时收回",
                        "属性牛无法绑定，远程牛无法骑乘",
                        "牛铃绑定的牛死亡后可以用救赎之心复活",
                        "复活后若牛铃不能正常使用收放功能了尝试重新执行一下绑定动作",
                        "暗影牛铃绑定的牛可以直接复活",
                        "骑牛使用远程武器时不再使牛获得战牛驯势",
                        "训好的牛血量上限大于1500血会强制缩小",
                        "牛在未完全训化时挨打有一定概率甩人",
                        "血量高于1200/1500的牛甩下玩家时造成20/50伤害",
                        "沃尔特骑牛时射程减半",
                        "薇格弗德骑牛时滑行冲刺距离随牛的体型增大而衰减",
                    }
                },
                ["猪人"] = {
                    title = "猪人",
                    content = {
                        "被喂食掉血会仇恨玩家",
                        "每天给予肉类或者武器会给予玩家一枚金块"
                    }
                },
                ["暗影猴"] = {
                    title = "暗影猴",
                    content = {
                        "被攻击会瞬闪到一定范围外，攻击时受击不会触发闪避瞬移",
                        "猴子便便也有伤害，普通猴子会对任何目标丢便便",
                        "没有便便时会消耗身上的掉落物香蕉来生成一个便便",
                        "猴子暗影化时不会掉落小肉，正常时不会掉落燃料",
                        "暗影猴也会投掷便便"
                    }
                },
                ["水獭"] = {
                    title = "水獭",
                    content = {
                        "玩家捡回偷取的物品时被发现会引起仇恨",
                        "增加飞跃能力",
                        "攻击会附带潮湿度提高效果",
                        "攻击会击飞极高潮湿度玩家",
                        "攻击欲望略微提高",
                        "生命值略微提高",
                        "额外掉落"
                    }
                },
                ["伏特羊"] = {
                    title = "伏特羊",
                    content = {
                        "受击带电",
                        "妥协阿尔法头羊放电回血"
                    }
                },
                ["食人花"] = {
                    title = "食人花",
                    content = {
                        "有眼球的食人花被采摘，会生成毒雾和树根圈，同时持续掉血（船上的不会）",
                        "食人花种子有新鲜度",
                        "食人花收缩诱饵时快速回血，平时缓慢回血，刚种时只有1点血，冬季会腐烂",
                        "血量提升"
                    }
                },
                ["月亮孢子"] = {
                    title = "月亮孢子",
                    content = {
                        "现在会连续爆炸"
                    }
                },
                ["脚印"] = {
                    title = "脚印",
                    content = {
                        "寻找的间隔更远",
                        "脚印尽头可能出现两个生物，成群的大象或者大象与钢羊，沼泽只会刷新钢羊",
                        "大象会浇灭周围的火焰",
                        "成群的大象不会离开彼此，刚羊会被大象帮助战斗"
                    }
                },
                ["格罗姆"] = {
                    title = "格罗姆",
                    content = {
                        "会主动吃周围昆虫,包括蜜蜂、蝴蝶、蚜虫、月熠等"
                    }
                },
                ["小切、哈奇"] = {
                    title = "小切、哈奇",
                    content = {
                        "没有碰撞体积，重复开关可以召唤（收回）分身"
                    }
                },
                ["鬼魂"] = {
                    title = "鬼魂",
                    content = {
                        "现在是冷源,阿比盖尔-20度,普通鬼魂-10度,小惊吓0度"
                    }
                },
                ["多枝树"] = {
                    title = "多枝树",
                    content = {
                        "可以直接采集树枝"
                    }
                },
                ["草根"] = {
                    title = "草根",
                    content = {
                        "变成草蜥蜴时会在原地再生草根"
                    }
                },
                ["杂草"] = {
                    title = "杂草",
                    content = {
                        "各种杂草可以种植"
                    }
                }
            }
        },
        ["敌对生物改动"] = {
            title = "敌对生物",
            subsection_order = {
                "岩石大白鲨","猎犬类","杀人蜂","海象","发条生物","坎普斯",
                "触手","寄生暗影","影怪","梦魇尖喙","爬行恐惧",
                "恐怖利爪","融合暗影","致命亮茄"
            },
            subsections = {
                ["岩石大白鲨"] = {
                    title = "岩石大白鲨",
                    content = {
                        "捕食时跳跃可以攻击周围生物",
                        "潜入水中不再可以被击中",
                        "飞跃附带击飞效果"
                    }
                },
                ["猎犬类"] = {
                    title = "猎犬类",
                    content = {
                        "蝙蝠的体型更小",
                        "猎犬丘中猎狗数量翻倍"
                    }
                },
                ["杀人蜂"] = {
                    title = "杀人蜂",
                    content = {
                        "每次出巢会刷新出6次远程攻击，次数用尽后恢复正常",
                        "富贵的杀人蜂兼容优化，仅近战命中施加中毒特效"
                    }
                },
                ["海象"] = {
                    title = "海象",
                    content = {
                        "巢中的海象变为两只",
                        "移速翻倍，攻速加快"
                    }
                },
                ["发条生物"] = {
                    title = "发条生物",
                    content = {
                        "不定时的周围生成月熠，被攻击时也有概率生成月熠，免疫带电额外伤害",
                        "没有防雷攻击或锤击带电发条会被月熠反伤",
                        "月熠散电会使发条回血进入短暂混乱状态，进入带电发光状态",
                        "完整发条死亡会变成损坏发条，损坏发条死亡变成损坏装置",
                        "锤子有低概率会锤开损坏装备，火药可与蛞蝓龟粘液可以炸开",
                        "较长时间后损坏的发条装置自动修复"
                    }
                },
                ["坎普斯"] = {
                    title = "坎普斯",
                    content = {
                        "出现会携带一只冰猎狗与一只火猎狗随从，共享仇恨",
                        "一段时间后会强制逃跑"
                    }
                },
                ["触手"] = {
                    title = "触手",
                    content = {
                        "被攻击时会释放类似桦树的树根攻击",
                        "命中则在脚底生成40血量的缠绕树须包围敌人"
                    }
                },
                ["寄生暗影"] = {
                    title = "寄生暗影",
                    content = {
                        "玩家初次疯狂10%概率产生，彻底疯狂时35%概率产生",
                        "洞穴世界的生成概率更高",
                        "200血量，攻击使玩家掉落生命值、血量与饱食度",
                        "玩家连续被击中会被击飞且会使寄生暗影进入小段时间的快速重生",
                        "在boss战中不会生成",
                        "帐篷无法用来躲避寄生暗影",
                        "打不过建议上下洞穴"
                    }
                },
                ["影怪"] = {
                    title = "影怪",
                    content = {
                        "玩家移速过快、地面单次伤害超过150、地下伤害超过100都会令影怪强制转换",
                        "梦魇尖喙与爬行恐惧转换，恐怖利爪与爬行恐惧转换",
                        "转换后总血量会变低并且受击后会继续转换，至多6次"
                    }
                },
                ["梦魇尖喙"] = {
                    title = "梦魇尖喙",
                    content = {
                        "首次攻击会发动远距离冲刺或两次近距离冲刺，冲刺技能有较长冷却时间",
                        "会打掉玩家手部武器，无手部武器则掉落头部装备",
                        "受击会远遁闪避，并且学会了隐身伪装",
                        "伪装化形成休憩影怪靠近附近的玩家，直到具备仇恨且从化形状态退出时出现袭击",
                        "消失或被骨头头盔驱使或死亡时，不再进入周期隐藏或周期化形，且一段时间内无法再次进入",
                        "死亡会在原地留下暗影陷阱，生物触碰会爆炸弹飞玩家恐惧生物",
                        "在地下爆炸时附近有生物则会生出恐怖利爪"
                    }
                },
                ["爬行恐惧"] = {
                    title = "爬行恐惧",
                    content = {
                        "受击后概率出现保护护盾回复血量，回血时无视非玩家一定程度的攻击，无视玩家的远程攻击",
                        "护盾回血，自己受伤必定释放回血或继续回血",
                        "其他影怪受伤则可以继续为其回血，其他影怪受伤且回血技能正在冷却则可以为其释放回血",
                        "持续施放至多12秒，前6秒每0.5秒给自己回血25，后6秒每0.75秒给群体队友回血50",
                        "禁锢，迅速移动到玩家脚下生成短暂延迟的暗影囚牢",
                        "死亡会在原地留下一个短暂延迟禁锢暗影囚牢其中生物，且能为队友提供治疗"
                    }
                },
                ["恐怖利爪"] = {
                    title = "恐怖利爪",
                    content = {
                        "较远会进行远距离攻击释放二连子弹",
                        "损失100血量会在瞬移后产生持续一段时间的排斥光波，持续12秒",
                        "持续制造荡漾波纹，击飞玩家同时推远玩家的船只",
                        "伤害50→30，远程伤害20",
                        "受到攻击会被打断施法"
                    }
                },
                ["融合暗影"] = {
                    title = "融合暗影",
                    content = {
                        "影虫子跳跃更快，移速更快，攻击会将敌人传送到裂隙并制造黑雾",
                        "孢子更快爆炸且能散射",
                        "死亡孢子更快追击"
                    }
                },
                ["致命亮茄"] = {
                    title = "致命亮茄",
                    content = {
                        "藤蔓数量变为三倍，每降低1/3的血量会转移位置，原地留下2茄壳并减少一个藤蔓数量上限",
                        "可以寄生食人花，且会改变其再生速率，令其防火，产生的眼球草无地形限制",
                        "反弹远程伤害",
                        "会伪装虚弱状态来欺骗玩家，正常状态可以假装成疲劳状态恢复血量和三维，并且重生藤蔓",
                        "春天裂隙刷新时，强制出现亮茄食人花"
                    }
                }
            }
        },
        ["怪物头目改动"] = {
            title = "怪物头目",
            subsection_order = {
                "座狼", "巨鹿", "熊獾", "蚁狮", "龙蝇", "蜂王", "树精", "桦树精", "果蝇王", "邪天翁", "大霜鲨", "帝王蟹", 
                "克劳斯", "双子魔眼", "暗影棋子", "毒菌蟾蜍", "远古守护者", "梦魇疯猪", "拾荒疯猪", "远古织影者",
                "天体英雄", "墨荒", "月后三王", "黑寡妇"
            },
            subsections = {
                ["座狼"] = {
                    title = "座狼",
                    content = {
                        "嗅觉增强，能在更远距离产生仇恨",
                        "移速翻倍，攻速翻倍"
                    }
                },
                ["巨鹿"] = {
                    title = "巨鹿",
                    content = {
                        "血量加倍",
                        "巨鹿战斗会伴随雪球雨",
                        "巨鹿击杀生物会积累杀人极星，环绕巨鹿周围不时生成冰冻法阵",
                        "在巨鹿血量低于3000时会消耗自己为巨鹿回复血量",
                        "身穿冰甲，生物攻击会积累冰冻值，可用火堆或者矮星消除层数，满层会冰冻生物",
                        "巨鹿半血以下会不时进入狂暴状态，移速与攻速加倍，周围生成类似帝王蟹的寒冰领域",
                        "结束狂暴时爆炸冰冻周围生物，并且狂暴期间攻击冰甲积累冰冻值的速度翻倍",
                        "猪人和队友可以帮忙解冻"
                    }
                },
                ["熊獾"] = {
                    title = "熊獾",
                    content = {
                        "熊攻击时不时的释放远程半月波攻击"
                    }
                },
                ["蚁狮"] = {
                    title = "蚁狮",
                    content = {
                        "血量翻倍",
                        "召唤的沙堡刺会燃烧",
                        "鄂之刃：会击飞半径4范围内的玩家，造成75点伤害并击飞，对其他生物造成200点伤害",
                        "收到一定伤害会钻入地下持续召唤沙刺攻击玩家，然后逃到其他位置钻出地面",
                        "发射沙之石攻击标记敌人，从而引发更多沙刺攻击",
                        "发动地震和沙尘暴攻击敌人，敌人过远则进入回血状态",
                        "释放沙尘暴，命中击飞玩家并使其进入减速状态",
                        "减速状态每秒受到最多3点伤害，方向键失灵，持续5秒",
                        "最后的巨大沙尘暴命中可以将玩家随机传送到附近随机位置",
                        "蚁狮在未收到攻击的脱战状态缓慢吃石子回复血量"
                    }
                },
                ["龙蝇"] = {
                    title = "龙蝇",
                    content = {
                        "血量低于50%则必定狂暴",
                        "在岩浆虫全部死亡后100%触发暴怒",
                        "周围会环绕3颗杀人矮星，不时的在玩家脚下生成火法阵",
                        "玩家死亡时会生成一颗杀人矮星",
                        "血量减少时消耗矮星回复龙蝇10%血量",
                        "远距离会释放火球攻击，狂暴三连拍之后必出一个五火球攻击",
                        "击杀龙蝇掉落的宝石数量为原来的3倍",
                        "永不妥协时令龙蝇，月光龙蝇不再跨加载跟随玩家"
                    }
                },
                ["蜂王"] = {
                    title = "蜂王",
                    content = {
                        "小蜜蜂速度是原来的1.5倍",
                        "攻速加倍，时间间隔为原来的2/3"
                    }
                },
                ["树精"] = {
                    title = "树精",
                    content = {
                        "残血如果周围有同类的树木，自身变为树木召唤其他树木变身树精伙伴继续追击",
                        "残血时周围若无树精和树木则自身石化",
                        "树精会令未铲掉的树根变身树苗精攻击敌人",
                        "被击杀会同时使全世界全部同类型的树精死亡",
                        "妥协受到boss伤害时会直接缩地",
                        "三种大小的树精死亡时会掉落6/9/12个活木"
                    }
                },
                ["桦树精"] = {
                    title = "桦树精",
                    content = {
                        "每次受到的砍伐效率不同时才会被砍伐"
                    }
                },
                ["果蝇王"] = {
                    title = "果蝇王",
                    content = {
                        "移动速度加倍，移动距离加长，攻击速度翻倍"
                    }
                },
                ["邪天翁"] = {
                    title = "邪天翁",
                    content = {
                        "对生物的远距离攻击会同时释放海浪与连续的冰锥攻击",
                        "潜水后可能会回到原址，冲刺后可能立即释放一次潜水",
                        "现在船上尝试释放潜水技能失败时，会尝试释放如来神掌，飞天再坠落下来进行一次攻击(60秒CD)",
                        "这次攻击会根据额外伤害船只且额外伤害对不在移动中的船只伤害翻倍"
                    }
                },
                ["大霜鲨"] = {
                    title = "大霜鲨",
                    content = {
                        "无法被控制，会自己挣脱束缚",
                        "可以出海不受限制",
                        "冰鲨加上每次召唤冰墙都会提高0.15倍移速和攻击动画(不包括带位移攻击)速率的机制"
                    }
                },
                ["帝王蟹"] = {
                    title = "帝王蟹",
                    content = {
                        "有可叠加的冰冻抗性",
                        "血量翻倍",
                        "苏醒不会受到伤害，帝王蟹苏醒时会生成海浪推开自身附近的船",
                        "释放海浪技能时会额外释放寒冰领域，寒冰领域会一直维持到帝王蟹创造冰面才会结束释放",
                        "帝王蟹生成的炮塔炮弹击中炮塔外圈海面时概率生成一座新的炮塔",
                        "击中内圈海面则概率生成一只蟹钳，击中船上或陆地概率生成一个蟹骑士",
                        "帝王蟹生成的蟹钳在距离目标过远时会水遁并传送至目标附近",
                        "目标在帝王蟹附近则距离识别会更短，蟹钳死亡后一定时间会重生",
                        "帝王蟹遭受攻击时攻击帝王蟹的目标不是追击目标则会立刻传送到攻击目标附近保护帝王蟹",
                        "蟹钳可以仇恨飞行生物",
                        "帝王蟹创造冰面期间受到攻击后会摧毁目标脚下的冰面"
                    }
                },
                ["克劳斯"] = {
                    title = "克劳斯",
                    content = {
                        "攻速翻倍，克劳斯影子跟随本体狂暴，影子鹿跟随克劳斯影子",
                        "给予赃物袋额外的鹿角使其狂暴"
                    }
                },
                ["双子魔眼"] = {
                    title = "双子魔眼",
                    content = {
                        "攻速翻倍，血量翻倍"
                    }
                },
                ["暗影棋子"] = {
                    title = "暗影棋子",
                    content = {
                        "升级的来源不可重复，相同棋子无法互相升级",
                        "三基佬同时在场会同时升级",
                        "半血会召唤影怪辅助战斗",
                        "伴随阶段的升级，暗影棋子会在周围释放的暗影陷阱的数量逐渐增加",
                        "一段时间后会进行战吼引爆陷阱再重新生成，会不时在玩家脚底生成禁锢法阵",
                        "脱离加载不会消失，无法行动",
                        "受到来自boss的伤害时会直接死亡且无掉落物",
                        "骑士移速更快，并且可以移动攻击",
                        "主教进攻结束会闪烁在暗影陷阱上，周围不存在则在闪烁位置脚下生成暗影陷阱",
                        "战车释放技能会召集地图上所有存在的暗影棋子到身边，并且技能会连续攻击三次"
                    }
                },
                ["毒菌蟾蜍"] = {
                    title = "毒菌蟾蜍",
                    content = {
                        "脱战会立即释放一次种树技能，且种树技能持续时间和频率缩短一半",
                        "脱离加载后会转换阵地",
                        "孢子云会像玩家移动",
                        "不同季节的孢子云获得属性强化",
                        "脱战后会回血，脱战时如果满血会逃走",
                        "种树时有敌人可以同时释放毒蘑菇炸弹技能",
                        "苦难蟾蜍的毒蘑菇炸弹会弹跳一次，毒雾速度更快"
                    }
                },
                ["远古守护者"] = {
                    title = "远古守护者",
                    content = {
                        "有可叠加的冰冻抗性",
                        "阵亡后会在远古大门的CD时间后重置远古，时间20天，期间击败远古织影者提前重置远古",
                        "石虾无法在犀牛攻击下防御",
                        "石虾的雇佣时间变为180秒",
                        "海星无法种植在地下",
                        "生命值增加6000",
                        "碰撞石柱进入晕眩状态或被攻击一定次数后在场地四周生成恶魔植物",
                        "玩家靠近自动摘取，有极高的san值惩罚的食物，连续食用两次会进入昏睡状态，丢弃时自动食用",
                        "碰撞石柱或者进入眩晕虚弱状态会在周围生成暗影触手陷阱，攻击到生物会生成藤蔓缠绕生物",
                        "跌落至8000血生成爬行梦魇梦魇尖喙暗影触手协助战斗",
                        "距离场地较远会脱战跳回中心回血",
                        "击杀犀牛的宝箱在操作了2~3个道具后就会移除剩下所有道具了，打开宝箱和每次操作道具都会提示玩家"
                    }
                },
                ["梦魇疯猪"] = {
                    title = "梦魇疯猪",
                    content = {
                        "石柱被稿击时会在周围生成黑雾，移动速度加快，虚弱时间减少",
                        "虚弱后会升级、增大体型、增加攻速、增加移速",
                        "虚弱时会在身边生成黑雾"
                    }
                },
                ["远古织影者"] = {
                    title = "远古织影者",
                    content = {
                        "玩家脱战后释放回血技能，连续处于脱战僵直状态会散架消失",
                        "鬼手被同种玩家的同种武器攻击时触发无敌，需使用不同的装备击杀",
                        "坠落之刺技能会在消失后生成固定刺，且会以织影者为中心绽放，固定尖刺技能6个会有1个出现随机缺口",
                        "织影者移速加快，攻速加快，技能释放时间减少，血量翻倍",
                        "玩家脱离中庭，远古大门会伸出鬼手追逐将玩家摄取回中心",
                        "召唤鬼手后也会召唤玩家的影分身攻击玩家，影分身不会受击消失",
                        "森林织影者生成植物的速度减慢"
                    }
                },
                ["拾荒疯猪"] = {
                    title = "拾荒疯猪",
                    content = {
                        "各种武器耐久增加至5点",
                        "翻找武器冷却时间和攻击间隔减少四分之三",
                        "无论是否开启月亮事件，激光炮都能翻出",
                        "初始血量阶段直接解锁同时持有不同武器能力",
                        "低于75%血量解锁翻找一次获得两件武器能力，增加脱战回血能力",
                        "命中会积累强力攻击值，强力攻击值满后，下次攻击无视铥棒或大理石甲免疫击退效果强制击飞并击落目标装备",
                        "被拥有巨兽标签的生物攻击会恢复满血并直接传回垃圾堆",
                        "击败会掉落所有原版蓝图和拾荒尖帽，并且额外掉落废料和视界扩展器的蓝图，移除原版拾荒尖帽掉落",
                        "影子不再是跟本体行为一致了，影子会和梦魇猪一样围绕玩家活动，并且会隔断时间执行干扰攻击"
                    }
                },
                ["天体英雄"] = {
                    title = "天体英雄",
                    subsubsections = {
                        ["全阶段改动"] = {
                            title = "全阶段改动",
                            content = {
                                "周围携带月亮风暴",
                                "生成月亮风暴时改变季节，打败之后对应秋季，敲损之后进入正常的秋天",
                                "一阶段对应夏季，二阶段对应春节，三阶段对应冬季",
                                "天体英雄在拥有自身影子的基础上，召唤前几个阶段的影子",
                            }
                        },
                        ["一阶段"] = {
                            title = "一阶段",
                            content = {
                                "滚动技能开始和结束时产生火焰风滚草",
                                "拍地板会在周围生成地震，翻滚处生出小型地陷，地陷都会缓慢消失",
                                "月灵攻击生成减伤护盾同时生成流星,结束时锁定玩家生成一颗大流星",
                                "滚动更远更持久，首次攻击到玩家会在一段时间内停下而不是急停",
                            }
                        },
                        ["二阶段"] = {
                            title = "二阶段",
                            content = {
                                "免疫电伤，攻击带电",
                                "大风车更快，并且残血会不断加速",
                                "大风车结束之后生成半包围，双竖线，双横线其中一种玻璃刺包围玩家",
                                "月灵攻击同时向玩家释放旋风",
                                "生成一排注能玻璃堆，一段时间消失，造成带电伤害",
                            }
                        },
                        ["三阶段"] = {
                            title = "三阶段",
                            content = {
                                "本体保持防守状态，不会主动进攻，影子处于进攻状态，会进攻所有靠近的敌人",
                                "攻击自己的敌人会被虚影标记，月灵大虚影会主动攻击",
                                "释放挥舞构成皇冠的晶体进行连续的两次范围攻击的同时生成护盾，脚下生成冰冻法阵，产生两束交叉激光进攻",
                                "月灵攻击会在周围生成一圈连续激光",
                                "启迪陷阱破碎会变成冰冻法阵",
                                "施法虚影技能时会把周围的地皮变成冰岛地皮，持续30秒后摧毁生成的所有冰岛地皮（之前的摧毁计时被覆盖）",
                                "天体阵亡或被删除时会立即摧毁其生成的所有冰岛地皮（之前的摧毁计时被覆盖）",
                                "有近距离斥力场了（无法跳劈，移速不能过高，减免远程伤害）"
                            }
                        },
                    }
                },
                ["墨荒"] = {
                    title = "墨荒",
                    content = {
                        "影战士的冲撞现在不会被打断且可以连续攻击敌人",
                        "影法师投弹可以弹射",
                        "影子坦克可以吞噬队友进行增强和回血，影战士和影法师会被影子坦克吞噬增强，技能增强，血量回满",
                        "影子坦克吞噬敌人或死亡后制造毒雾"
                    }
                },
                ["月后三王"] = {
                    title = "月后三王",
                    subsubsections = {
                        ["附身虚影"] = {
                            title = "附身虚影",
                            content = {
                                "月后新三王掉落一定血量会增加一个分身",
                                "如果有血量高于自己的分身,则与该分身交换位置和血量,同时增加一个新的分身",
                                "月后新三王掉落血量或者释放技能概率发生",
                                "没有血量高于自己的分身,则传送所有分身到自己附近，分身血量降低概率和本体交换位置"
                            }
                        },
                        ["附身座狼"] = {
                            title = "附身座狼",
                            content = {
                                "喷火时被月亮武器连续攻击2次疲惫",
                                "分身是影火座狼,分身也会创造疲惫机会，远距离追逐释放影火",
                                "附身座狼杀死10只猎狗之后，新的猎狗不会掉落战利品"
                            }
                        },
                        ["装甲熊灌"] = {
                            title = "装甲熊灌",
                            content = {
                                "掉血800后且敌人在侧后方则屁股蹲攻击(首次疲惫后还会主动冲刺屁股蹲攻击),主动暴露破绽",
                                "屁股蹲期间月亮武器连续攻击进入疲惫",
                                "冲刺时主动屁股蹲",
                                "拥有普通熊大的半月波",
                                "妥协开启时具有普通熊灌的机制"
                            }
                        },
                        ["晶体独眼巨鹿"] = {
                            title = "晶体独眼巨鹿",
                            content = {
                                "当两根冰刺都用完还有眼球冰且被点燃时,开始挣扎，挣扎会逐渐熄灭火焰，多次挣扎才能进入虚弱状态",
                                "鹿释放技能会召唤类似大冰鲨的的冰墙阻拦敌人"
                            }
                        },
                    }
                },
                ["黑寡妇"] = {
                    title = "黑寡妇",
                    content = {
                        "妥协兼容改动，AI计算速度从2秒1次变成依旧很慢的1秒1次",
                        "攻速3秒一次缩短1/4",
                        "技能和远程武器在合适时机都更加优先释放了,技能强度也适度增加",
                        "黑寡妇的远程攻击,直线连续蛛网现在会把敌人抓到自己脚下,且抓到脚下后会继续1秒之前的控制效果",
                        "黑寡妇的跳跃现在移速不再是固定了,而是准确计算以跳跃到目标脸上的速度了",
                        "黑寡妇地面丢出几团蜘蛛网,现在蜘蛛网血量更多且范围稍微变大",
                        "二阶段会生成三只地穴蜘蛛，跟随寡妇作为其随从",
                        "蜘蛛茧概率生成的动物不再死亡保留随机生命值,概率<无额外掉落仅动物死亡掉落",
                        "会吃掉地上食物",
                        "触手棒现在妥协开启时可以开寡妇包"
                    }
                }
            }
        },    
        ["简单模式"] = {
            title = "简单模式(主题2)",
            subsection_order = {"机制改动", "永不妥协补丁", "新物品", "小丑", "流浪商人"},
            subsections = {
                ["机制改动"] = {
                    title = "机制改动",
                    content = {
                        "季节起始物品升级：（原版默认第10天后）草20，树枝10，木头10，燧石1",
                        "   春天雨衣；冬天牛帽，暖石；夏天花衬衫，暖石",
                        "危险时也能入睡,入睡后摆脱敌人仇恨",
                        "用燃烧的火焰烹饪,比如猪人火炬,冰篝火,燃烧的树木,甚至手持的火把",
                        "净化怪兽肉为肉,用蜘蛛腺体药膏等治疗道具净化怪物肉，熟怪物肉等",
                        "净化概率为治疗血量/肉的掉血量",
                        "作祟地上的告密的心复活,扣除25%血上限",
                        "可以直接材料修理草甲木甲影甲大理石甲鳞甲影刀",
                        "泰拉瑞亚宝箱掉落弹性空间制造器，具有临时属性但腐烂速率为零",
                        "玩家上线时自动拣取周围眼骨类不可替代道具",
                        "洞穴可以铺设码头,但会在几天后自毁",
                        "猪王小游戏没有场地限制",
                        "获得食物提供的温度buff时仅保留剩余时间较长的，而不直接覆盖",
                        "移动容器可以在移动时保持开启",
                    }
                },
                ["永不妥协补丁"] = {
                    title = "永不妥协补丁",
                    content = {
                        "修复猪王守卫可以用蒸树枝雇佣的问题，且雇佣时料理饱食度需求由75下调为60，1次能雇佣2个了",
                        "月泪有1天的新鲜度",
                        "融合发条掉落物削弱",
                    }
                },
                ["新物品"] = {
                    title = "新物品",
                    content = {
                        "小糖豆：开局赠送2个；料理，饥饿+5 理智+1 生命+1，提供buff，每8秒回复1生命1理智，持续2分钟",
                        "  烹饪条件存在甜度，存在浆果，水果度>=1，无怪物，无不可食用，1次产出3个",
                        "夜莓慕斯：大厨料理，要求夜莓≥2，获得夜莓夜视buff效果2天，负面理智光环为直接食用夜莓的1/2",
                        "灵魂瓶:使用空瓶子对敲碎骨架生成的小灵魂使用获得；用于给予哀悼之穴",
                        "哀悼之穴:敲碎死去玩家的骨头会出现灵魂"
                    }
                },
                ["小丑"] = {
                    title = "小丑",
                    content = {
                        "高分奖励更多",
                        "   >600，  金块×4，齿轮×2，海象牙×1",
                        "   >1000， 金块×8，齿轮×4，绿宝石×1",
                        "   >1400,  金块×16，七色宝石各×1，坎普斯背包",
                        "低分奖励更少，刷新怪物时可能出现海盗猴",
                        "沃特角色牌暂时禁用",
                        "奖励生成拥有15秒冷却,无法偷看牌"
                    }
                },
                ["流浪商人"] = {
                    title = "流浪商人",
                    content = {
                        "交易后会提示剩余次数",
                        "物品可交易次数增加；刷新时间为16天",
                        "原随机交易配方3猪皮→1齿轮替换为3废铁→1齿轮",
                        "随机交易新增专属掉落，概率为50%，独立刷新：3花瓣→1蜂蜜；3胡须→1蛛丝；3烂电线→1视界拓展套件"
                    }
                },
            }
        },
        ["角色改动"] = {
            title = "角色改动",
            subsection_order = {"技能点", "怪物夜视", "威尔逊", "薇洛", "沃尔夫冈", "温蒂", "薇克巴顿", 
                                "吴迪", "维斯", "WX-78", "麦斯威尔", "薇格弗德", "薇诺娜", "韦伯", "沃利", 
                                "沃尔特", "沃拓克斯", "沃姆伍德", "沃特", "旺达", "芜猴", "沃托姆"},
            subsections = {
                ["技能点"] = {
                    title = "技能点",
                    content = {
                        "获取洞察点改为累计该角色游玩天数解锁",
                        "解锁洞察点需5经验点数，可遗忘当前技能点并获取3经验点数",
                        "玩家每游玩1天可获取该角色1经验点数"
                    }
                },
                ["怪物夜视"] = {
                    title = "怪物夜视",
                    content = {
                        "韦伯、沃特、妥协的沃托姆、闪闪（老鼠人）获得夜视能力",
                        "夜视角色夜晚的降理智光环改为白天生效；黄昏，夜晚以及洞穴不生效"
                    }
                },
                ["威尔逊"] = {
                    title = "威尔逊",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "威尔逊出生携带一本科技",
                                "拥有右键冲刺能力（冷却1s），滑铲期间无敌受击不会掉落护甲耐久",
                                "右键自身可以使用万物百科（叠加两次可解锁更高级科技的能力），30s，消耗33理智"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "暂无额外困难模式限制"
                            }
                        }
                    }
                },
                ["薇洛"] = {
                    title = "薇洛",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "余烬无限堆叠，打火机耐久为零不会消失",
                                "对未被点燃的干燥目标倍率为1.5倍，对点燃的干燥目标倍率为2.5倍，潮湿目标无论是否点燃伤害倍率均为1倍",
                                "狂热焚烧自带发光，持续时间内战斗会一直延续技能效果，潮湿目标无论是否点燃伤害倍率均为1.25倍",
                                "右键自身可释放意念控火术，吸收余烬和火焰",
                                "控火术吸收到余烬时不消耗理智，仅灭火消耗33理智（手动丢余烬选择是否消耗理智）",
                                "手持火源切换其他工具或者武器时，会给对应装备附着火焰，获得照明和引燃攻击目标的能力",
                                "火焰笔和火魔杖攻击方式改动，会释放一团火焰扔向目标，造成34点伤害并点燃目标",
                                "可控燃烧：燃烧对周围目标产生伤害的范围缩小为普通火焰的30%",
                                "燃烧周期：妥协开启时，使周围可控燃烧火源无视冬季燃烧时间缩短影响",
                                "狂热焚烧：消耗5余烬，持续时间由60秒延长至240秒，战斗不再能自动延长狂热焚烧持续时间",
                                "再次释放该技能可提前结束（不消耗余烬）",
                                "狂热焚烧buff开启时薇洛获得等同于辣龙椒沙拉的升温buff",
                                "月焰纵火犯：新增可逆转火球属性，三秒后转化火球、矮星为降温冷星，可以消除农田地裂"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "狂热焚烧技能buff存在期间对未被点燃的干燥目标倍率为1.25倍，对点燃的干燥目标倍率为1.5倍",
                                "未开启狂热焚烧技能则对未被点燃的干燥目标倍率为1倍，对点燃的干燥目标倍率为1.25倍",
                                "潮湿目标无论是否点燃伤害倍率均为1倍",
                                "理智黑化：仅月焰、暗焰技能会扣除20理智上限",
                                "潮湿状态伯尼每次受击会额外受到17点的真实伤害(额外受伤让青蛙也能对伯尼重拳出击)",
                                "月火削弱，会直接灭掉生物身上的火焰且一小段时间内无法引燃",
                                "暗焰纵火犯和月焰纵火犯现在都会使目标获得火焰抗性，短时间受到多次伤害时递减",
                                "每次命中同一目标叠加5%抗性，最高40%，2秒后开始衰减，每秒5%，10秒后完全恢复"
                            }
                        }
                    }
                },
                ["沃尔夫冈"] = {
                    title = "沃尔夫冈",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "变强壮的动画时间减少",
                                "吃土豆及土豆料理时获得额外三维收益，永不妥协开启时土豆料理获得额外理智收益",
                                "吃食物能从饱食度获取默认35%的健身值",
                                "饥饿值高于100时不会随时间减少健身值",
                                "如50力量值基础伤害倍率为1，100力量值时为1.5，150力量值时为2.0",
                                "练腿日：普通形态不再获得基础移速加成；强壮形态常驻1.25倍移速",
                                "突破极限：健身房和紫宝石哑铃可突破100力量值上限",
                                "暗影守卫/月亮战略家：每级获得阵营伤害加成由10%下调为5%",
                                "杂物锻炼：当力量值高于75时每15点力量值额外获得10%暴击概率，最高50%，触发一击必杀时消耗15点力量值",
                                "点亮1/2/3级杂物锻炼后消耗的力量值分别为12/9/6",
                                "哑铃开发者：火铃和冰铃需要破损远古伪科技站解锁，宝石哑铃需要完整远古伪科技站解锁"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "仅关闭妥协改动时生效",
                                "大理石甲的伤害减免由95%削弱为90%",
                                "理智上限由200下调为为150",
                                "饥饿值高于100时不会随时间减少健身值选项：要求理智高于75",
                                "强壮时饱食度消耗速率为1.75倍；虚弱时0.75倍",
                                "移除沃尔夫冈受形态影响的伤害倍率而是受力量值影响",
                                "基础倍率（力量值为0时）为0.5，每有1点力量值获得0.01倍率"
                            }
                        }
                    }
                },
                ["温蒂"] = {
                    title = "温蒂",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "默认拥有1.0角色攻击倍率",
                                "使用药剂可以同时生效，新药剂不会覆盖别的药剂效果（对幽魂花冠无效）",
                                "对阿比盖尔之花使用药剂使温蒂自身获得额外效果：",
                                "   夜影万金油：夜视，25%伤害倍率加成；强健精油：获得15%移速加成（骑牛不生效）",
                                "对幽魂花冠使用获得额外效果：",
                                "   强健精油：获得15%移速加成",
                                "温蒂死亡不会掉落阿比盖尔的等级，阿比盖尔时每次死亡掉落1级",
                                "温蒂在释放阿比盖尔时获得与阿比盖尔相同的护盾效果",
                                "温蒂在释放2级以上阿比盖尔时自身获得和阿比盖尔相同的小范围光源",
                                "哀悼荣耀复活蝴蝶时批量复活4个",
                                "骨灰罐保鲜技能点亮时放入骨灰罐的花瓣可以永久保鲜",
                                "阿比盖尔在三级暗影姐妹情点亮后生成分身，且月亮虚影形态下无法生成",
                                "阿比盖尔在虚影形态时不会受到谋杀暗影魔法影响",
                                "坟墓装饰完成时会生成1个小惊吓，小惊吓任务完成时坟墓可能生成额外的哀悼荣耀",
                                "月晷转化阿比时非新月即可转化为虚影阿比，非满月即可转化为普通阿比",
                                "虚影形态连续命中多个目标时伤害削减为上一个的5/6（原版为3/4），冲刺冷却为6秒（原版为10秒）",
                                "月树花庇护的阿比盖尔冲刺时有90%的额外减伤",
                                "幽魂花冠无新鲜度，具有耐久，使用哀悼荣耀修复，可以储存buff，重载时失效"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "默认拥有1.0角色攻击倍率不生效",
                                "阿比盖尔的护盾减伤由100%削减到90%",
                                "阿比盖尔收回时不再获得经验且升级速度减慢，16天升一级（需骨灰罐加速）",
                                "阿比盖尔回复血量速度减慢，骨灰盒启动状态下约18秒回复1血（需使用灵体草药）",
                                "阿比盖尔有体温，高于0度停止自动回血，高于50度持续掉血，夜影暗金油会将过热温度提高到70度",
                                "小惊吓任务的路程增加（需点亮小惊吓技能）",
                                "万灵药成本增加:夜影万金油额外需要1个鼹鼠，强健精油额外需要1个兔子，恐怖经历额外需要20血量",
                                "灵魂容器成本增加：额外需要10个哀悼荣耀",
                                "幽魂花冠成本增加：额外需要2个噩梦燃料",
                                "鬼魂复仇拥有3天冷却",
                                "阿比盖尔逃离动作后收回有1秒冷却",
                                "灵魂容器无法在非自然地形部署"
                            }
                        }
                    }
                },
                ["薇克巴顿"] = {
                    title = "薇克巴顿",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "可以睡帐篷和遮阳棚等，依旧免疫催眠",
                                "免疫黑暗、怪物、装备等环境的掉san效果",
                                "使用火魔杖消耗20%耐久可以点火球（同薇洛火球术），使用冰魔杖消耗5%耐久可以召唤冰墙",
                                "自带随身书架，右键自身打开，每天增加1本随机书籍且耐久仅1次，可以额外放入四本正常的书籍",
                                "书架中存在四本不同书籍解锁航海科技，八本解锁二本科技，十二本解锁人物书籍科技，十六本解锁三本科技",
                                "薇克巴顿默认自带科学机器科技且使用自身书架科技，使用其他科技站时需右键科技站",
                                "薇克巴顿根据理智值消耗书籍耐久，理智值越高消耗耐久越低，在满理智只消耗书籍0.35次耐久",
                                "控温学可以维持35度体温，并提供100%防水，持续4分钟",
                                "意念控火术可以消除永不妥协夏季燃烧浓烟",
                                "月之魔典可以召唤极光，效果同唤月魔杖"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "书籍耐久变为2次",
                                "初始仅解锁六本书籍，在书架解锁的书籍需升级书架才可制作新书籍",
                                "书架全员可做，书籍制作依旧是维克巴顿享有",
                                "书架的回复速度削弱为原版的2倍",
                                "阅读书籍消耗身上对应材料：",
                                "   世界鸟类大全：种子×4；园艺学简编/拓展版：便便×5/×10",
                                "   应用造林学：活木×2；睡前故事：噩梦燃料×1",
                                "   触手的召唤：触手皮×1；末日将至！：无",
                                "   垂钓者生存指南：藤壶×3；意念控火术：无",
                                "   克服蛛形纲恐惧症：蛛丝×1；控温学：无",
                                "   永恒之光/复兴：无；实用求雨仪式：麋鹿毛×1",
                                "   养蜂笔记：蜂刺×1；万物百科：无",
                                "养蜂笔记召唤嗡嗡蜜蜂上限 16 → 8",
                                "妥协开启时月之魔典困难模式制作额外消耗1彩虹宝石，月光转化术仅满月生效，且耐久回调为1次"
                            }
                        }
                    }
                },
                ["吴迪"] = {
                    title = "吴迪",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "海狸像消耗2木头1怪物肉，鹅像消耗2种子2怪物肉，鹿像消耗2草3怪物肉",
                                "变身时穿着的装备将优先放入人物库存或背包",
                                "变身值变为饱食度，变身状态下有2.25饥饿消耗消耗速率；变身状态下，右键自身可以变回人形态",
                                "吃各种生肉时没有负面惩罚",
                                "鹿人形态下冲刺过程无敌，撞击可以直接摧毁路途上的树木和大理石柱等，最多摧毁2个，撞击障碍或巨兽后会进入短暂的虚弱状态，虚弱状态期间不可使用撞击",
                                "海狸夜间砍树不会出蝙蝠",
                                "变形计时：变身时消耗饱食度速率2/1.75/1.5",
                                "拥抱诅咒：变身为三种形态时均获得缓慢的理智回复",
                                "拐杖雕刻：使用活木升级使其一段时间内获得额外20%/15%/10%加速效果",
                                "暗影牧人：变身结束后的30秒内也对影怪保持中立",
                                "月亮叛徒：随机获得一种俗气雕像",
                                "露西斧增强：拥有跟正常斧子相同的伤害（27.2），点亮\"树精守卫伐木者\"技能后对树精造成双倍伤害并免疫桦树精的效率抵抗",
                                "硬木帽可用木头修理，拥有20%防水，完全吸收落石伤害",
                                "鹿人形态移速为1.2倍角色基础移速；海狸形态为1.5倍角色基础移速",
                                "俗气雕像配方材料减少：海狸像怪物肉消耗减少2；鹅像怪物肉和种子消耗减少1",
                                "俗气海狸像，俗气鹅像，俗气鹿像现在分别回复10/20/30的饱食度",
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "吃怪物肉不再能变身",
                                "吃各种生肉时没有负面惩罚不生效",
                                "诅咒鹿像制作额外消耗3个活木"
                            }
                        }
                    }
                },
                ["维斯"] = {
                    title = "维斯",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "拥有威尔逊的三维，即150饱食度，200理智值，150血量",
                                "拥有威尔逊的攻击倍率与工作效率",
                                "可以连续右键冲刺（2次），冷却时间2s",
                                "气球有50伤害，堆叠上限提升至10，堆叠气球可以提升爆炸伤害，堆叠气球数量大于等于5则气球被碰撞时会吸附在目标身上并持续减速目标，气球引爆会造成伤害",
                                "气球背心、帽子、普通气球装备都会额外提供20%移速加成，所有气球物品的耐久增加至1天耐久",
                                "挨打时身上的气球装备会爆掉形成旋风，也可右键将气球扔向目标形成旋风",
                                "单个气球旋风有50点伤害（气球爆炸）和7点的后续伤害，可伐木挖矿，但不会破坏建筑"
                            }
                        }
                    }
                },
                ["WX-78"] = {
                    title = "WX-78",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "拆电路板不消耗耐久不掉电力；同种电路板可以融合升级",
                                "生物数据可以修理电路，每个修理25%",
                                "永不妥协改动开启时wx-78基础三维100/100/100→125/125/125",
                                "机器人吃齿轮升级，单个三维加5点，最多十五次"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "升级的电路使用后每一级会增加0.125的饥饿消耗",
                                "饥饿电路不再拥有减少饥饿速率的作用",
                                "插拔芯片会保留三维，而不是百分比刷新"
                            }
                        }
                    }
                },
                ["麦斯威尔"] = {
                    title = "麦斯威尔",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "吃花瓣获得噩梦花瓣",
                                "开局解锁暗夜甲、暗夜剑、噩梦燃料的配方",
                                "获得暗影魔法增强时暗影囚笼和暗影陷阱释放不再消耗理智",
                                "影袭：暗影等级大于等于4可以右键影袭，消耗手部装备或者身体装备耐久",
                                "对路径上的目标造成1.5倍施法手部武器的伤害，位面武器暗袭伤害→2倍武器伤害＋1倍武器位面伤害，冷却6秒",
                                "骨甲护盾：暗影等级大于等于4时获得骨头盔甲被动，冷却时间28秒，每有1暗影等级冷却时间缩短2秒，最短8秒",
                                "右键自身释放睡前故事，冷却30秒"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                ""
                            }
                        }
                    }
                },
                ["薇格弗德"] = {
                    title = "薇格弗德",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "激励值脱战不掉落",
                                "骑乘时可以右键冲刺，1.5秒冷却，期间无敌，骑乘的牛体型越大时冲刺的距离越短",
                                "粗鲁插曲在50激励值以上可以修复全体队员头甲，修理的耐久度是临时耐久，修理消耗33点激励值",
                                "惊心独白在50激励值以上可以修复全体队员手部装备，修理的耐久度是临时耐久，修理消耗33点激励值",
                                "修复的装备限定为专属装备，包括头盔：战斗头盔，统帅头盔，武器：战斗长矛，奔雷矛，充能奔雷矛，战斗圆盾",
                                "奔雷矛可以储存月熠提高伤害，防雷，非女武神可以冲刺，但不会回耐久还会消耗月熠",
                                "理智上限120→150"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "骑行获得的激励值速率和上限减少",
                                "血量上限200→180",
                                "（充能）奔雷矛伤害59.5→51",
                                "攻击假人、牌堆及切斯特等单位时时会扣除激励值"
                            }
                        }
                    }
                },
                ["薇诺娜"] = {
                    title = "薇诺娜",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "快速制作不受饱食度影响",
                                "使用锤子敲掉物品可以返还物品完整材料，有耐久的物品则根据其耐久获得材料",
                                "右键旋转武器获得2.5秒的1.25倍伤害和5秒的增加移速25%的buff，2秒冷却时间,期间加速饥饿消耗1.75倍",
                                "右键友好的发条怪物可以命令发条镇守领地（原地放生）",
                                "右键自身折叠空间，使用后一定范围内的所有建筑、物体隐形，隐形的物体不会阻挡玩家放置建筑，根据折叠的物品数量消耗大量理智值"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "校准观察机被禁止用于解锁蓝图解锁的物品配方（打包袋等）"
                            }
                        }
                    }
                },
                ["韦伯"] = {
                    title = "韦伯",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "理智值上限提升至200",
                                "右键自身释放蛛形纲恐惧症，消耗33点理智",
                                "吃肉食收买附近蜘蛛，饥饿大于102消耗3点饥饿额外收买一只直至100饱食度",
                                "谋杀非黑蜘蛛获得涂鸦，需要饱食度大于等于150消耗75点饥饿获得一个（每天上限6个）",
                                "蜘蛛丝升级蜘蛛巢，可变成蜘蛛女王",
                                "随从不吃地面肉食且跟随灵魂",
                                "白蜘蛛与黄蜘蛛可以帮助韦伯进行伐木，破碎蜘蛛与洞穴蜘蛛会帮助韦伯进行采矿",
                                "韦伯的头部装备与蜘蛛随从共享，帽子戏法"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "韦伯升级蜘蛛巢现在需要用食物喂养而不是用蜘蛛丝了（50饱食度等于1蜘蛛丝）",
                                "蜘蛛巢每消耗50饱食度都会重新生成1~3个蜘蛛在蜘蛛巢内"
                            }
                        }
                    }
                },
                ["沃利"] = {
                    title = "沃利",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "吃料理回血1.5倍，扣血减半",
                                "使用新鲜度武器增伤，新鲜武器1.25倍武器伤害、不新鲜武器1.00倍武器伤害、变质武器0.75倍武器伤害",
                                "右键自身开启烹饪红锅",
                                "使用烹饪锅不需要燃料",
                                "盐调味使料理有2倍的保质期",
                                "每日第一次烹饪100%返还第一格食物，并回复33点理智（使用龙蝇火炉烹饪不返还）",
                                "吃专属料理以及调味料理获得的buff时长翻倍，开启困难模式时沃利以外的角色时获得的buff时长减半",
                                "收集食谱可以减少重复料理的理智损耗，每收集1个食谱都会使额外的理智损耗-1，最低为0",
                                "便携香料站可以批量调味"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "有自身烹饪锅时开局不自带锅",
                                "食用重复的食物会有额外理智值损益，随重复食用次数增加而上升",
                                "便携烹饪锅，便携研磨器，便携香料站現在額外需要一个紅寶石",
                                "每日第一次烹饪100%返还第一格食物削弱为50%返还第一格食物，50%返还第二格食物"
                            }
                        }
                    }
                },
                ["沃尔特"] = {
                    title = "沃尔特",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "受伤害时不再损失理智（开启理智险境依旧会掉san）",
                                "正常领养宠物",
                                "点亮技能暗影冲刺后沃比受击会使用暗影冲刺来躲避伤害（cd为2.5s）",
                                "被沃比摔下时暂时无敌",
                                "沃比的饱食度上限增加为200",
                                "便携篝火所有角色可用，但除沃尔特外拆除需要锤子",
                                "妥协开启wixie改动沃尔特依旧能使用和制作自己的弹弓和弹药，并且可以使用原版和妥协的弹弓攻击方式",
                                "妥协的部分子弹伤害稍微削弱，相关效果强削弱",
                                "弹弓蓄力攻击时间变成1.7倍（wixie1.6倍），且饥饿值上限越低，蓄力攻击时间还需要更久至多再额外1倍，最慢需要2.7倍用时才能完成1次蓄力射击"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "基础子弹产量20→10",
                                "紫宝石弹减速效果：每层1/3→1/5",
                                "弹弓蓄力射程30→20",
                                "可食用弹药的食物度1→0.1",
                                "基础射程范围10~14→9~12",
                                "骑牛时弹弓射程削弱为0.5倍（沃比才是最好的伙伴，骑在牛上很难瞄准）",
                                "帐篷卷：回复45%以上的三维及理智，耐久为6次，饱食度消耗翻倍",
                                "被摧毁时将不再返还任何材料",
                                "妥协开启时，wixie的弹弓攻击无法击退敌人"
                            }
                        }
                    }
                },
                ["沃拓克斯"] = {
                    title = "沃拓克斯",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "灵魂死亡不掉落，灵魂罐内的灵魂不会流失",
                                "身上灵魂少于10个时首次灵魂跳跃不消耗灵魂",
                                "三维均大于75%时获得0.25额外倍率",
                                "装备灵魂可以远程攻击灵魂飞弹，基础伤害51",
                                "妥协掉落修改开启时，血量高的生物添加额外掉落灵魂",
                                "高于100血的有10%的概率额外掉落第一个灵魂",
                                "高于500血的有30%的概率额外掉落第二个灵魂",
                                "高于1000血的有50%的概率额外掉落第三个灵魂",
                                "好孩子吞噬灵魂不再消耗更多理智，但是获取的饱食度减半",
                                "淘气包释放灵魂能正常回复理智，释放灵魂不再减少血量回复",
                                "淘气包身上和灵魂罐内的灵魂能提供理智回复效果，上限15个灵魂+26.7/天",
                                "开局可以自己选择好孩子和淘气包倾向了，不再受到其余技能点的影响",
                                "灵魂飞弹基在点亮灵魂穿刺后由单体伤害改为与灵魂穿刺相同的范围效果",
                                "收到灵魂穿刺的伤害加成影响，命中目标后不再消失有75%的概率被回收，25%的概率靠近玩家后自动释放",
                                "手持灵魂可以消耗灵魂通过封闭楼梯"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "吃食物获取75%三维",
                                "三维低于25%时每项-0.25倍率",
                                "妥协开启时改为仅基础血量高于100的生物掉落灵魂",
                                "没有血量组件的生物被谋杀时不再掉落灵魂",
                                "即兴演奏技能消耗排箫耐久减半",
                                "悦耳牧歌召唤的灵魂数量受范围内玩家数量影响，每个玩家召唤2个灵魂",
                                "悦耳牧歌点亮时不催眠队友",
                                "迷魂曲点亮时催眠时间延长一倍（无法强制无仇恨）"
                            }
                        }
                    }
                },
                ["沃姆伍德"] = {
                    title = "沃姆伍德",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "可从食物中获得一半的生命回复收益",
                                "采集的作物可以再生（采集后原地种下对应作物的种子）",
                                "开花状态与农作物对话将减少部分生长时间，减少时间效果随开花等级增强",
                                "死亡的骨架敲碎后生成的小灵魂在地裂土地上自然消失可以滋养土地，治愈地裂（需要死在那一格地皮上，敲骨架后仅可治愈这一个地皮的地裂）",
                                "在白天会进行光合作用，光合作用效果为回复沃姆伍德的san值，每五秒进行一次光合作用，光合作用回复效果随开花等级增强",
                                "右键自身装备灌木丛帽，右键灌木丛帽可睡觉，同兔毛卷",
                                "吃食物获得装备，具有临时属性，新鲜度6天，每天仅限2次",
                                "临时护甲减免伤害时会消耗耐久值对应的新鲜度",
                                "临时武器在战斗中的损耗（每次攻击消耗0.5%~1%）",
                                "可以获取的装备：熟肉→橄榄球头盔",
                                "  蝴蝶翅膀→步行手杖；烤小鱼块、烤蛙腿→雨衣；烤种子→高级耕作帽；荧光果→矿工帽",
                                "  小发光浆果→鼹鼠帽；烤蘑菇→对应蘑菇帽；月娥翅膀→启迪之冠；熟怪物肉→触手尖刺",
                                "  电羊奶→晨星锤；烤蝙蝠翅膀→蝙蝠棒；烤石果→玻璃刀；月树花→月亮玻璃斧；烤土豆→大理石甲",
                                "  烤火龙果→鳞甲；苔藓→骨甲；仙人掌肉→荆棘甲",
                                "吃杂草获得buff（默认关闭）",
                                "受到仙人掌，玫瑰等反击伤害，有25%的概率在附近生成一株针刺旋花植株"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "如果开启了食物改动-种子改动则不可以随地种种子",
                                "采集作物再生需要佩戴高级耕作帽采集并且每次会扣除自身1.5饱食度"
                            }
                        }
                    }
                },
                ["沃特"] = {
                    title = "沃特",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "鱼人王不会饥饿",
                                "沃特吃食物收买鱼人，大于151饱食度时，每消耗2点饥饿收买一个随从，直至100饱食度",
                                "吃食物还可以延长鱼人随从忠诚时间",
                                "每天首次和鱼人交易淡水鱼或海鱼可以获得食物和金子"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "鱼人王科技需要三叉戟",
                                "鱼人死亡小概率变成青蛙",
                                "世界不存在鱼人王鱼人堡垒也能生成和刷新鱼人守卫，且守卫虚弱时的生命值和攻击数值与正常鱼人一致"
                            }
                        }
                    }
                },
                ["旺达"] = {
                    title = "旺达",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "不再随时间衰老",
                                "不老表会将体温回至常温，并恢复少量饥饿上限",
                                "右键倒走，与倒走表一致",
                                "右键自身召唤裂隙表，可定位，鼠标拿起隐藏，传送冷却时间24分钟，钟表匠工具自身可解除定位",
                                "死亡可以复活，在血量旁边有二次机会表按钮，复活方式与二次机会表相同，冷却时间32分钟"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "不老表需要额外的红蓝宝石",
                                "溯源表需要额外橙宝石",
                            }
                        }
                    }
                },
                ["芜猴"] = {
                    title = "芜猴",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "芜猴开局可以角色选人界面选择，芜猴的理智值上限提升至200",
                                "进入奔跑状态的时间缩短至0.5秒，奔跑状态无额外饥饿消耗",
                                "芜猴走路时的移速与正常角色一致了，奔跑加速度更快",
                                "夜晚有微光，有夜视能力",
                                "消耗一点san值投射粪肥，造成34点伤害，便便击中目标有30%概率返还",
                                "攻击可以偷取物品",
                                "身上不会有诅咒饰品（自动消除）",
                                "右键自身发射信号弹召唤芜猴小分队（默认关闭）"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "暂无额外困难模式限制"
                            }
                        }
                    }
                },
                ["沃托姆"] = {
                    title = "沃托姆",
                    subsubsections = {
                        ["简单模式"] = {
                            title = "简单模式",
                            content = {
                                "激活时的易伤为2倍",
                                "锁定夜视仅远古区域生效",
                                "禁用超远索敌",
                                "任何攻击行为都可以额外获得1点肾上腺素",
                                "很难对阵天体三阶段"
                            }
                        },
                        ["困难模式"] = {
                            title = "困难模式",
                            content = {
                                "骑牛时无法获得亮茄法杖专属攻击模式"
                            }
                        }
                    }
                }
            }
        },
        ["建筑改动"] = {
            title = "建筑改动",
            subsection_order = {
                "科学机器","炼金引擎","灵子分解器","暗影操控器","土地夯实器",
                "钓具容器","制图桌","烹饪锅","辉煌铁匠","暗影术基座","智囊团","砂之塔","龙鳞火锅","假人"
            },
            subsections = {
                ["科学机器"] = {
                    title = "科学机器",
                    content = {
                        "给材料会精炼",
                        "给齿轮升级,升级提高制作的速率，满级10级"
                    }
                },
                ["炼金引擎"] = {
                    title = "炼金引擎",
                    content = {
                        "有威尔逊的炼金术,给材料会消耗材料进行威尔逊的炼金",
                        "给月岩会消耗大理石炼成月岩,不能炼成彩虹宝石",
                        "给4个齿轮升1级，提升转化的速率，升到30级（满级40）月亮暗影转化术",
                        "可选像猪王一样兑换金块"
                    }
                },
                ["灵子分解器"] = {
                    title = "灵子分解器",
                    content = {
                        "分解给它的道具并返还道具的至多50%的材料，给绿宝石升级2次后可以返回至多100%的材料",
                        "耐久越高返回越高",
                        "连续给堆叠道具会全部分解堆叠道具，精炼栏制作的物品在拆解时有损耗"
                    }
                },
                ["暗影操控器"] = {
                    title = "暗影操控器",
                    content = {
                        "给4噩梦燃料会至少20天内解锁麦斯威尔的专属制作配方和暗影秘典高礼帽使用能力",
                        "到期自动移除，可继续给予燃料续费5天vip，vip天数上限30天，可通过魔术帽查看",
                        "使用暗影秘典的施法速度翻倍",
                        "普通角色同时只能召唤1个影子",
                        "老麦则会读书理智消耗降低到1"
                    }
                },
                ["土地夯实器"] = {
                    title = "土地夯实器",
                    content = {
                        "可以像蚁狮一样兑换沙之石但兑换速度更快"
                    }
                },
                ["钓具容器"] = {
                    title = "钓具容器",
                    content = {
                        "默认将其变成一个20格0.15倍腐烂速率的末影箱,可以容纳钓具箱可以容纳的道具和制作好的菜肴",
                        "可选像鱼人王一样兑换海鱼"
                    }
                },
                ["制图桌"] = {
                    title = "制图桌",
                    content = {
                        "可以给与其一个道具消耗一个草纸,获得该道具的学习蓝图"
                    }
                },
                ["烹饪锅"] = {
                    title = "烹饪锅",
                    content = {
                        "制作食谱卡片功能,可以制作料理配方卡"
                    }
                },
                ["辉煌铁匠"] = {
                    title = "辉煌铁匠",
                    content = {
                        "可以精炼纯粹辉煌"
                    }
                },
                ["暗影术基座"] = {
                    title = "暗影术基座",
                    content = {
                        "可以制作绝望石"
                    }
                },
                ["智囊团"] = {
                    title = "智囊团",
                    content = {
                        "可以制作浮木"
                    }
                },
                ["砂之塔"] = {
                    title = "砂之塔",
                    content = {
                        "沙之石可以激活"
                    }
                },
                ["龙鳞火锅"] = {
                    title = "龙鳞火锅",
                    content = {
                        "可以批量烹饪"
                    }
                },
                ["假人"] = {
                    title = "假人",
                    content = {
                        "可以交换随从,方便管理"
                    }
                }
            }
        },  
        ["道具改动"] = {
            title = "道具改动",
            subsection_order = {"牛铃", "钓具箱", "催眠睡袋", "视界拓展套件", "出逃腿靴", 
                                "诅咒饰品", "海盗地图", "草席卷和毛皮铺盖", "暗影心房", "强心针", 
                                "留声机", "告密的心", "冬季盛宴礼物包装", "打包袋", "陷阱", "犬牙陷阱", "捕鱼器", "兔子帽", "敌对信号弹"},
            subsections = {
                ["牛铃"] = {
                    title = "牛铃",
                    content = {
                        "可以用橙宝石升级,升级后可以同时召唤和收回牛"
                    }
                },
                ["钓具箱"] = {
                    title = "钓具箱",
                    content = {
                        "可以容纳角色专属道具,永久保鲜,可以存放孢子和蜘蛛"
                    }
                },
                ["催眠睡袋"] = {
                    title = "催眠睡袋",
                    content = {
                        "给予毛皮卷和帐篷可以升级,耐久翻倍且可在任何时段睡觉",
                        "能自动回复耐久，回复理智上限，回复血量上限时无视百分比"
                    }
                },
                ["视界拓展套件"] = {
                    title = "视界拓展套件",
                    content = {
                        "升级护目镜，增加视野范围"
                    }
                },
                ["出逃腿靴"] = {
                    title = "出逃腿靴",
                    content = {
                        "携带时可以免疫滑倒"
                    }
                },
                ["诅咒饰品"] = {
                    title = "诅咒饰品",
                    content = {
                        "加强（反向的），可堆叠，一组上限10个",
                        "不会使玩家变成芜猴，但是无法转移，无法丢弃",
                        "溺水和死亡不掉落，换角色不掉落",
                        "消失方法：与月亮码头女王交易，1根香蕉抵消1个诅咒",
                        "1张海盗地图抵消4个诅咒，消失时间变为原来的8倍（32分钟）"
                    }
                },
                ["海盗地图"] = {
                    title = "海盗地图",
                    content = {
                        "可以发现额外的宝藏（克劳斯boss掉落包裹）"
                    }
                },
                ["草席卷和毛皮铺盖"] = {
                    title = "草席卷和毛皮铺盖",
                    content = {
                        "只能在理智值或生命值大于50%时回复状态"
                    }
                },
                ["暗影心房"] = {
                    title = "暗影心房",
                    content = {
                        "置于船上使船变成黑心船，血量增加到800点",
                        "可以自动修复但是有次数限制",
                        "接触方向舵可以开启自动航行，再次触摸取消自动驾驶"
                    }
                },
                ["强心针"] = {
                    title = "强心针",
                    content = {
                        "合成材料增加蚊子血囊",
                        "能直接回复最大饱食度一半的饥饿上限"
                    }
                },
                ["留声机"] = {
                    title = "留声机",
                    content = {
                        "现在有耐久，一个齿轮补充20%耐久"
                    }
                },
                ["告密的心"] = {
                    title = "告密的心",
                    content = {
                        "可以作祟复活，作祟的容器会掉落其中的心",
                        "作祟复活不会掉落血量上限"
                    }
                },
                ["冬季盛宴礼物包装"] = {
                    title = "冬季盛宴礼物包装",
                    content = {
                        "不再保鲜"
                    }
                },
                ["打包袋"] = {
                    title = "打包袋",
                    content = {
                        "无需绳子制作"
                    }
                },
                ["陷阱"] = {
                    title = "陷阱",
                    content = {
                        "捕捉兔子、蜘蛛等的灵敏度增加"
                    }
                },
                ["犬牙陷阱"] = {
                    title = "犬牙陷阱",
                    content = {
                        "犬牙陷阱制作材料额外添加1狗牙，耐久 10次 → 40次",
                        "荆棘陷阱耐久 10次 → 20次"
                    }
                },
                ["捕鱼器"] = {
                    title = "捕鱼器",
                    content = {
                        "鱼未满时也会撑破渔网，每容纳一只鱼每分钟都有5%的概率撑破渔网"
                    }
                },
                ["兔子帽"] = {
                    title = "兔子帽",
                    content = {
                        "抓兔子时额外消耗一个胡萝卜"
                    }
                },
                ["敌对信号弹"] = {
                    title = "敌对信号弹",
                    content = {
                        "夏、秋季节召唤世界上现有的一只熊獾，概率50%",
                        "流浪商人脱加载的移动速度由4倍调整为1.5倍"
                    }
                }
            }
        },
        ["装备改动"] = {
            title = "装备改动",
            subsection_order = {"刮地皮头盔", "铥矿棒", "多用斧镐", "懒人魔杖", "懒人护符", 
                                "玻璃刀", "启迪之冠", "甲板照明灯", "眼球伞", "火腿棒", 
                                "鳞甲", "晨星锤", "香炉", "骨头头盔", "恐怖盾牌和恐怖面具",
                                "火把", "扫把", "蜂王帽", "拾荒尖帽", "红绿蓝蘑菇帽",
                                "种子袋", "木头短剑", "水手帽", "熊皮大衣", "建造护符"},
            subsections = {
                ["刮地皮头盔"] = {
                    title = "刮地皮头盔",
                    content = {
                        "可以自动种树,放草叉可以自动刮地皮"
                    }
                },
                ["铥矿棒"] = {
                    title = "铥矿棒",
                    content = {
                        "有格挡攻击功能,可以格挡敌人"
                    }
                },
                ["多用斧镐"] = {
                    title = "多用斧镐",
                    content = {
                        "万能工具,可以剃毛、剪羊毛、刮胡子,右键操作"
                    }
                },
                ["懒人魔杖"] = {
                    title = "懒人魔杖",
                    content = {
                        "使用不消耗耐久而是进入15秒的冷却",
                        "冷却时间内使用正常消耗耐久"
                    }
                },
                ["懒人护符"] = {
                    title = "懒人护符",
                    content = {
                        "鼠标持有时点击收集可以堆叠周围的物品到背包",
                        "妥协开启时可以拾取蘑菇（额外消耗少量理智）"
                    }
                },
                ["玻璃刀"] = {
                    title = "玻璃刀",
                    content = {
                        "有跳劈攻击功能,可以进行远程跳跃攻击"
                    }
                },
                ["启迪之冠"] = {
                    title = "启迪之冠",
                    content = {
                        "根据放入的每个孢子提高属性",
                        "红绿蓝孢子依次是60保暖,20%防水,60隔热",
                        "放5个红孢子后变热源携带生效",
                        "放5个绿孢子后绝缘携带即生效",
                        "放5个蓝孢子后变冷源，携带生效"
                    }
                },
                ["甲板照明灯"] = {
                    title = "甲板照明灯",
                    content = {
                        "可以装备在头部,并常规添加燃料",
                        "耐久越高照明越高（默认关闭）"
                    }
                },
                ["眼球伞"] = {
                    title = "眼球伞",
                    content = {
                        "下雨时恢复耐久,下雪时3倍恢复耐久",
                        "放地上也回,酸雨无效"
                    }
                },
                ["火腿棒"] = {
                    title = "火腿棒",
                    content = {
                        "可以补充肉类食物提高攻击力恢复新鲜度",
                        "喂食给恐怖盾牌，眼面具时每次只会减少0.5重量",
                        "不能直接吃肉的角色禁止“啃一口”",
                        "右键可以啃食回复饥饿，理智和血量，受新鲜度和污染度影响"
                    }
                },
                ["鳞甲"] = {
                    title = "鳞甲",
                    content = {
                        "可以防御冰冻效果,提供额外保护"
                    }
                },
                ["晨星锤"] = {
                    title = "晨星锤",
                    content = {
                        "可以储存月熠升级，增加伤害解锁远程攻击能力"
                    }
                },
                ["香炉"] = {
                    title = "香炉",
                    content = {
                        "吸取影怪血量恢复耐久",
                        "切换装备后仍照明和继续吸取"
                    }
                },
                ["骨头头盔"] = {
                    title = "骨头头盔",
                    content = {
                        "影怪助战,召唤的影怪会协助攻击但消耗耐久"
                    }
                },
                ["恐怖盾牌和恐怖面具"] = {
                    title = "恐怖盾牌和恐怖面具",
                    content = {
                        "增强,获得攻击，受击反击吸取敌人血量回复耐久的能力",
                        "攻击三次后触发，受击有冷却时间",
                        "低耐久时会扣取玩家饱食度"
                    }
                },
                ["火把"] = {
                    title = "火把",
                    content = {
                        "可以用亮茄外壳、纯粹辉煌、纯粹恐惧或绝望石升级"
                    }
                },
                ["扫把"] = {
                    title = "扫把",
                    content = {
                        "可以升级,每个世界各绑定一个科技站"
                    }
                },
                ["蜂王帽"] = {
                    title = "蜂王帽",
                    content = {
                        "给予蜂召唤蜂巢，采集蜂箱不引起蜜蜂仇恨",
                        "妥协开启时采集蜂箱不掉血"
                    }
                },
                ["拾荒尖帽"] = {
                    title = "拾荒尖帽",
                    content = {
                        "掉落时满耐久",
                        "耐久提升至840，耐久为零不消失",
                        "免疫落石伤害",
                        "护甲减伤 85% → 75%，但受到飞行伤害时为90%"
                    }
                },
                ["红绿蓝蘑菇帽"] = {
                    title = "红绿蓝蘑菇帽",
                    content = {
                        "依次有240保暖,100%防水,240隔热",
                        "不新鲜后该属性变弱"
                    }
                },
                ["种子袋"] = {
                    title = "种子袋",
                    content = {
                        "永久保鲜"
                    }
                },
                ["木头短剑"] = {
                    title = "木头短剑",
                    content = {
                        "填进火堆做燃料，极小概率出现海盗地图"
                    }
                },
                ["水手帽"] = {
                    title = "水手帽",
                    content = {
                        "给予制图桌擦除，小概率出现海盗地图"
                    }
                },
                ["熊皮大衣"] = {
                    title = "熊皮大衣",
                    content = {
                        "保暖值 240 → 960"
                    }
                },
                ["建造护符"] = {
                    title = "建造护符",
                    content = {
                        "携带建造护符时修理不能解锁配方的装备（铥装备，玻璃刀等）耐久",
                        "用建造护符直接修补道具的耐久（默认关闭）",
                        "制作材料减半的效果不再对无法解锁配方原型的物品制作生效"
                    }
                }
            }
        },
    }
}

return _G.ENCYCLOPEDIA_DATA2HM




